import React, {Component, useContext, useEffect, useState} from "react";
import axios from 'axios';
import { Service } from "../api_params/service";
import { Link } from "react-router-dom";
import './entity_checks.scss';
import PageHeader from "../page-header/page-header";
import { SearchContext } from "../context_for_search";


function EntityCheks (){

    return(
        <div>

            <body>
                <header className="page-header">
                    <nav className="page-header__navigation">
                        <a href="#" className="logo">
                            <svg width="208" height="19" viewBox="0 0 208 19" fill="none" xmlns="http://www.w3.org/2000/svg">
                            <path d="M14.9295 12.73V17.58C14.9295 17.8333 14.8428 18.0367 14.6695 18.19C14.4961 18.3433 14.2695 18.42 13.9895 18.42H12.1795V15H0.959453V0.489999H3.97945V12.73H9.88945V0.489999H12.9095V12.73H14.9295ZM19.9951 2.84V6.57H24.8351V8.84H19.9951V12.65H26.2151V15H16.9751V0.489999H26.2151V2.84H19.9951ZM40.8895 0.489999V15H37.8695V8.75H31.4795V15H28.4595V0.489999H31.4795V6.65H37.8695V0.489999H40.8895ZM54.1982 2.91H49.9582V15H46.9482V2.91H42.7082V0.489999H54.1982V2.91ZM60.8985 7.71C61.8385 7.71 62.5252 7.48333 62.9585 7.03C63.3985 6.57667 63.6185 5.95667 63.6185 5.17C63.6185 4.81 63.5618 4.48333 63.4485 4.19C63.3418 3.89 63.1752 3.63667 62.9485 3.43C62.7285 3.21667 62.4485 3.05333 62.1085 2.94C61.7685 2.82667 61.3652 2.77 60.8985 2.77H58.9985V7.71H60.8985ZM60.8985 0.489999C61.8918 0.489999 62.7485 0.606666 63.4685 0.84C64.1952 1.07333 64.7918 1.4 65.2585 1.82C65.7252 2.23333 66.0685 2.72667 66.2885 3.3C66.5152 3.87333 66.6285 4.49667 66.6285 5.17C66.6285 5.88333 66.5118 6.53667 66.2785 7.13C66.0452 7.72333 65.6918 8.23333 65.2185 8.66C64.7452 9.08667 64.1485 9.42 63.4285 9.66C62.7085 9.89333 61.8652 10.01 60.8985 10.01H58.9985V15H55.9985V0.489999H60.8985Z" fill="#0065B1"/>
                            <path d="M72.2337 2.24C72.7937 1.67333 73.487 1.21333 74.3137 0.86C75.147 0.506666 76.1003 0.329999 77.1737 0.329999C77.8803 0.329999 78.5503 0.413332 79.1837 0.58C79.817 0.739999 80.4003 0.976666 80.9337 1.29C81.467 1.59667 81.9437 1.97 82.3637 2.41C82.7903 2.85 83.1537 3.34333 83.4537 3.89C83.7537 4.43667 83.9803 5.03667 84.1337 5.69C84.2937 6.33667 84.3737 7.02 84.3737 7.74C84.3737 8.81333 84.2103 9.80333 83.8837 10.71C83.557 11.6167 83.0903 12.4 82.4837 13.06C81.877 13.72 81.1403 14.2367 80.2737 14.61C79.407 14.9767 78.4303 15.16 77.3437 15.16C76.1437 15.16 75.107 14.9667 74.2337 14.58C73.367 14.1933 72.6403 13.6267 72.0537 12.88L73.2437 11.61C73.3103 11.5433 73.377 11.4967 73.4437 11.47C73.517 11.4433 73.5903 11.43 73.6637 11.43C73.757 11.43 73.8437 11.45 73.9237 11.49C74.0103 11.53 74.0903 11.58 74.1637 11.64C74.3703 11.8333 74.5803 11.9933 74.7937 12.12C75.007 12.2467 75.2303 12.35 75.4637 12.43C75.697 12.51 75.9503 12.5667 76.2237 12.6C76.5037 12.6333 76.8137 12.65 77.1537 12.65C77.6603 12.65 78.1403 12.5633 78.5937 12.39C79.0537 12.2167 79.4637 11.9667 79.8237 11.64C80.1837 11.3067 80.487 10.8967 80.7337 10.41C80.9803 9.92333 81.147 9.36667 81.2337 8.74H74.7637V6.55H81.2137C81.1203 5.96333 80.9537 5.44 80.7137 4.98C80.4803 4.52 80.1903 4.13333 79.8437 3.82C79.497 3.5 79.097 3.26 78.6437 3.1C78.197 2.93333 77.7137 2.85 77.1937 2.85C76.6403 2.85 76.187 2.90667 75.8337 3.02C75.4803 3.13333 75.1837 3.26 74.9437 3.4C74.7037 3.54 74.5037 3.66667 74.3437 3.78C74.1837 3.89333 74.0203 3.95 73.8537 3.95C73.6937 3.95 73.567 3.91667 73.4737 3.85C73.387 3.78333 73.3103 3.70667 73.2437 3.62L72.2337 2.24ZM99.1849 15H96.4449C96.1716 15 95.9416 14.93 95.7549 14.79C95.5683 14.6433 95.3949 14.43 95.2349 14.15L92.4649 9.43C92.3849 9.29 92.2983 9.17333 92.2049 9.08C92.1183 8.98667 92.0216 8.91333 91.9149 8.86C91.8149 8.8 91.6983 8.76 91.5649 8.74C91.4383 8.72 91.2949 8.71 91.1349 8.71H89.5649V15H86.5649V0.489999H89.5649V6.48H90.8749C91.1349 6.48 91.3616 6.43333 91.5549 6.34C91.7483 6.24667 91.9283 6.07333 92.0949 5.82L95.0249 1.28C95.1649 1.04667 95.3349 0.856666 95.5349 0.71C95.7349 0.563333 95.9749 0.489999 96.2549 0.489999H98.8249L95.0649 6.26C94.8983 6.52 94.7016 6.73667 94.4749 6.91C94.2483 7.07667 93.9983 7.21 93.7249 7.31C94.1516 7.42333 94.5116 7.61 94.8049 7.87C95.0983 8.12333 95.3749 8.48 95.6349 8.94L99.1849 15ZM110.019 11.43C110.186 11.43 110.326 11.49 110.439 11.61L111.629 12.88C111.042 13.6267 110.312 14.1933 109.439 14.58C108.572 14.9667 107.539 15.16 106.339 15.16C105.252 15.16 104.276 14.9767 103.409 14.61C102.542 14.2367 101.806 13.72 101.199 13.06C100.592 12.4 100.126 11.6167 99.7991 10.71C99.4725 9.80333 99.3091 8.81333 99.3091 7.74C99.3091 7.02 99.3858 6.33667 99.5391 5.69C99.6991 5.03667 99.9291 4.43667 100.229 3.89C100.529 3.34333 100.889 2.85 101.309 2.41C101.736 1.97 102.216 1.59667 102.749 1.29C103.282 0.976666 103.862 0.739999 104.489 0.58C105.122 0.413332 105.796 0.329999 106.509 0.329999C107.042 0.329999 107.546 0.376666 108.019 0.469999C108.499 0.563333 108.946 0.693333 109.359 0.86C109.772 1.02667 110.152 1.23 110.499 1.47C110.852 1.70333 111.169 1.96 111.449 2.24L110.439 3.62C110.379 3.70667 110.302 3.78333 110.209 3.85C110.116 3.91667 109.989 3.95 109.829 3.95C109.669 3.95 109.506 3.89333 109.339 3.78C109.179 3.66667 108.979 3.54 108.739 3.4C108.506 3.26 108.209 3.13333 107.849 3.02C107.496 2.90667 107.046 2.85 106.499 2.85C105.892 2.85 105.336 2.96 104.829 3.18C104.322 3.4 103.886 3.72 103.519 4.14C103.159 4.55333 102.879 5.06333 102.679 5.67C102.479 6.27667 102.379 6.96667 102.379 7.74C102.379 8.52 102.486 9.21667 102.699 9.83C102.919 10.4367 103.216 10.95 103.589 11.37C103.969 11.79 104.409 12.11 104.909 12.33C105.416 12.5433 105.956 12.65 106.529 12.65C106.869 12.65 107.176 12.6333 107.449 12.6C107.729 12.5667 107.986 12.51 108.219 12.43C108.459 12.35 108.682 12.2467 108.889 12.12C109.102 11.9933 109.316 11.8333 109.529 11.64C109.602 11.58 109.679 11.53 109.759 11.49C109.839 11.45 109.926 11.43 110.019 11.43ZM125.273 15H122.253V2.76H116.343V15H113.323V0.489999H125.273V15ZM131.323 2.84V6.57H136.163V8.84H131.323V12.65H137.543V15H128.303V0.489999H137.543V2.84H131.323ZM144.688 7.71C145.628 7.71 146.314 7.48333 146.748 7.03C147.188 6.57667 147.408 5.95667 147.408 5.17C147.408 4.81 147.351 4.48333 147.238 4.19C147.131 3.89 146.964 3.63667 146.738 3.43C146.518 3.21667 146.238 3.05333 145.898 2.94C145.558 2.82667 145.154 2.77 144.688 2.77H142.788V7.71H144.688ZM144.688 0.489999C145.681 0.489999 146.538 0.606666 147.258 0.84C147.984 1.07333 148.581 1.4 149.048 1.82C149.514 2.23333 149.858 2.72667 150.078 3.3C150.304 3.87333 150.418 4.49667 150.418 5.17C150.418 5.88333 150.301 6.53667 150.068 7.13C149.834 7.72333 149.481 8.23333 149.008 8.66C148.534 9.08667 147.938 9.42 147.218 9.66C146.498 9.89333 145.654 10.01 144.688 10.01H142.788V15H139.788V0.489999H144.688ZM162.597 2.91H158.357V15H155.347V2.91H151.107V0.489999H162.597V2.91ZM176.827 0.489999V15H173.807V6.35C173.807 5.99 173.817 5.61333 173.837 5.22C173.857 4.82 173.897 4.4 173.957 3.96C173.81 4.35333 173.654 4.72 173.487 5.06C173.32 5.4 173.16 5.69667 173.007 5.95L167.977 14.08C167.91 14.1933 167.83 14.3033 167.737 14.41C167.644 14.5167 167.54 14.6167 167.427 14.71C167.32 14.7967 167.2 14.8667 167.067 14.92C166.94 14.9733 166.804 15 166.657 15H164.397V0.489999H167.417V9.14C167.417 9.5 167.407 9.88 167.387 10.28C167.367 10.6733 167.327 11.09 167.267 11.53C167.414 11.1367 167.57 10.77 167.737 10.43C167.904 10.09 168.064 9.79333 168.217 9.54L173.247 1.4C173.314 1.29333 173.394 1.18667 173.487 1.08C173.58 0.966666 173.68 0.866666 173.787 0.779999C173.9 0.693333 174.02 0.623333 174.147 0.569999C174.28 0.516666 174.42 0.489999 174.567 0.489999H176.827ZM179.036 1.87C179.602 1.39 180.282 1.01333 181.076 0.739999C181.869 0.466665 182.742 0.329999 183.696 0.329999C184.496 0.329999 185.216 0.423332 185.856 0.61C186.502 0.796667 187.052 1.06 187.506 1.4C187.959 1.73333 188.306 2.13667 188.546 2.61C188.792 3.07667 188.916 3.59333 188.916 4.16C188.916 4.82667 188.766 5.43667 188.466 5.99C188.172 6.54333 187.716 6.99667 187.096 7.35C187.416 7.51 187.709 7.69667 187.976 7.91C188.249 8.12333 188.479 8.36 188.666 8.62C188.859 8.88 189.009 9.16 189.116 9.46C189.222 9.76 189.276 10.0767 189.276 10.41C189.276 11.07 189.152 11.69 188.906 12.27C188.659 12.8433 188.299 13.3433 187.826 13.77C187.359 14.19 186.782 14.5233 186.096 14.77C185.409 15.0167 184.626 15.14 183.746 15.14C183.246 15.14 182.746 15.0933 182.246 15C181.752 14.9067 181.279 14.7767 180.826 14.61C180.372 14.4433 179.946 14.2433 179.546 14.01C179.152 13.7767 178.802 13.5167 178.496 13.23L179.386 11.81C179.459 11.7033 179.552 11.6167 179.666 11.55C179.786 11.4767 179.916 11.44 180.056 11.44C180.242 11.44 180.442 11.5067 180.656 11.64C180.869 11.7733 181.119 11.92 181.406 12.08C181.692 12.24 182.032 12.3867 182.426 12.52C182.819 12.6533 183.289 12.72 183.836 12.72C184.662 12.72 185.306 12.5467 185.766 12.2C186.226 11.8533 186.456 11.2967 186.456 10.53C186.456 10.2233 186.389 9.95 186.256 9.71C186.129 9.46333 185.949 9.25667 185.716 9.09C185.482 8.92333 185.199 8.79667 184.866 8.71C184.532 8.62333 184.166 8.58333 183.766 8.59H181.686L181.676 6.21H183.536C184.369 6.21 185.006 6.05667 185.446 5.75C185.886 5.44333 186.106 4.99667 186.106 4.41C186.106 3.89667 185.899 3.49 185.486 3.19C185.079 2.89 184.476 2.74 183.676 2.74C183.216 2.74 182.816 2.79 182.476 2.89C182.136 2.99 181.839 3.10333 181.586 3.23C181.339 3.35 181.122 3.46 180.936 3.56C180.756 3.66 180.592 3.71 180.446 3.71C180.292 3.71 180.166 3.67667 180.066 3.61C179.966 3.53667 179.869 3.42667 179.776 3.28L179.036 1.87ZM196.725 12.7C197.199 12.7 197.592 12.6467 197.905 12.54C198.219 12.4333 198.469 12.29 198.655 12.11C198.842 11.9233 198.972 11.71 199.045 11.47C199.125 11.23 199.165 10.9767 199.165 10.71C199.165 10.41 199.125 10.1367 199.045 9.89C198.972 9.64333 198.842 9.43333 198.655 9.26C198.475 9.08 198.229 8.94333 197.915 8.85C197.602 8.75667 197.205 8.71 196.725 8.71H194.545V12.7H196.725ZM196.725 6.4C197.692 6.4 198.519 6.50667 199.205 6.72C199.892 6.93333 200.449 7.22333 200.875 7.59C201.309 7.95667 201.625 8.38333 201.825 8.87C202.025 9.35 202.125 9.86333 202.125 10.41C202.125 11.1033 202.002 11.7333 201.755 12.3C201.515 12.86 201.165 13.34 200.705 13.74C200.245 14.14 199.679 14.45 199.005 14.67C198.339 14.89 197.579 15 196.725 15H191.545V0.489999H194.545V6.4H196.725ZM207.045 15H204.025V0.489999H207.045V15Z" fill="#EE3F58"/>
                            </svg>
                            <span className="logo__visually-hidden">Иконка</span>
                        </a>
                        <ul className="page-header__icon-navigation">
                        <li className="page-header__icon-navigation-item">
                            <span className="cb-icon cb-icon__size-24">
                            <svg width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
                                <path fill-rule="evenodd" clip-rule="evenodd" d="M16.2775 17.8831L5.91126 15.0659L8.54746 7.49991C9.32077 5.28049 11.6703 4.04247 13.9396 4.65866L14.4601 4.80001C16.7295 5.41619 18.1533 7.6788 17.728 9.99269L16.2775 17.8831ZM3.96233 16.0983L3.96478 16.0912L3.00049 15.8292L3.38361 14.3789L4.45952 14.6713L7.13353 6.99683C8.16461 4.0376 11.2973 2.38692 14.323 3.2085L14.8436 3.34985C17.8693 4.17143 19.7679 7.18824 19.2007 10.2734L17.7293 18.2777L18.8044 18.5699L18.4213 20.0201L17.4571 19.7581L17.4563 19.7623L16.0045 19.3681L14.4434 18.9442C13.5698 20.5132 11.731 21.3485 9.93451 20.8607C8.13799 20.3728 6.9577 18.7178 6.97534 16.9164L5.41419 16.4925L3.96233 16.0983ZM8.49867 17.33C8.63921 18.3077 9.33741 19.1442 10.318 19.4105C11.2985 19.6767 12.3159 19.3061 12.92 18.5306L8.49867 17.33Z" fill="#0D4CD3"/>
                                <path d="M22 12C22 14.2091 20.2091 16 18 16C15.7909 16 14 14.2091 14 12C14 9.79086 15.7909 8 18 8C20.2091 8 22 9.79086 22 12Z" fill="#EE3F58"/>
                            </svg>
                            </span>
                        </li>
                        </ul>
                        <ul className="page-header__site-navigation">
                        <li className="page-header__site-navigation-item">
                            <a href="" className="page-header__site-navigation-link">Настройки</a>
                        </li>
                        <li className="page-header__site-navigation-item">
                            <a href="" className="page-header__site-navigation-link">Каталог ЦП</a>
                        </li>
                        </ul>
                        <ul className="user-navigation">
                        <li className="user-navigation__icon">
                            <span className="user-navigation__icon-text">АС</span>
                            <span className="user-navigation__icon-dropdown cb-icon cb-icon__size-24">
                            <svg width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
                                <path d="M17.7046 13.2805C18.0985 13.6739 18.0985 14.3116 17.7046 14.705C17.3108 15.0983 16.6723 15.0983 16.2785 14.705L11.2869 9.71945C10.8931 9.3261 10.8931 8.68836 11.2869 8.29501C11.6807 7.90166 12.3193 7.90166 12.7131 8.29501L17.7046 13.2805Z" fill="currentColor"/>
                                <path d="M7.72152 14.7048C7.3277 15.0982 6.68919 15.0982 6.29537 14.7048C5.90154 14.3115 5.90154 13.6737 6.29537 13.2804L11.2869 8.29501C11.6807 7.90166 12.3193 7.90166 12.7131 8.29501C13.1069 8.68836 13.1069 9.32595 12.7131 9.7193L7.72152 14.7048Z" fill="currentColor"/>
                            </svg>
                            </span>
                        </li>
                        <li className='user-navigation__menu'>
                            <div className="user-navigation__header">
                            <div className="user-navigation__title">
                                <div className='user-navigation__avatar'>АС</div>
                                <p className="user-navigation__title__text">Александр Сергеевич</p>
                            </div>
                            <p className="user-navigation__organization">Организация</p>
                            </div>
                            <div className="user-navigation__info">
                            <p className="user-navigation__info-item">+7 000 000 00 00</p>
                            <p className="user-navigation__info-item">Email</p>
                            </div>
                            <div className="user-navigation__list">
                            <div className='user-navigation__item'>
                                <span className="cb-icon cb-icon__size-24">
                                <svg width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
                                    <path fill-rule="evenodd" clip-rule="evenodd" d="M17.3266 18.6244C19.2617 17.0664 20.5 14.6778 20.5 12C20.5 7.30558 16.6944 3.5 12 3.5C7.30558 3.5 3.5 7.30558 3.5 12C3.5 14.6778 4.73826 17.0664 6.67343 18.6244C7.2842 16.2525 9.43744 14.5 12 14.5C14.5626 14.5 16.7158 16.2525 17.3266 18.6244ZM15.9712 19.5172C15.7328 17.5357 14.0457 16 12 16C9.95426 16 8.26721 17.5357 8.02884 19.5172C9.21409 20.1447 10.5655 20.5 12 20.5C13.4345 20.5 14.7859 20.1447 15.9712 19.5172ZM12 22C17.5228 22 22 17.5228 22 12C22 6.47715 17.5228 2 12 2C6.47715 2 2 6.47715 2 12C2 17.5228 6.47715 22 12 22ZM12 11.5C12.8284 11.5 13.5 10.8284 13.5 10C13.5 9.17157 12.8284 8.5 12 8.5C11.1716 8.5 10.5 9.17157 10.5 10C10.5 10.8284 11.1716 11.5 12 11.5ZM12 13C13.6569 13 15 11.6569 15 10C15 8.34315 13.6569 7 12 7C10.3431 7 9 8.34315 9 10C9 11.6569 10.3431 13 12 13Z" fill="currentColor"/>
                                    </svg>
                                </span>
                                <p className="user-navigation__item__text">Профиль</p>
                            </div>
                            <div className='user-navigation__item'>
                                <span className="cb-icon cb-icon__size-24">
                                <svg width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
                                    <path fill-rule="evenodd" clip-rule="evenodd" d="M3.49902 13.7368L3.49902 10.2649L3.79498 10.1801C5.68553 9.6382 6.80682 7.69586 6.33067 5.78769L6.25338 5.47798L9.24308 3.74631L9.45679 3.95375C10.8729 5.32832 13.1251 5.32832 14.5413 3.95375L14.755 3.7463L17.7447 5.47797L17.6674 5.78769C17.1912 7.69586 18.3125 9.6382 20.2031 10.1801L20.499 10.2649L20.499 13.7368L20.2031 13.8216C18.3125 14.3635 17.1913 16.3058 17.6674 18.214L17.7447 18.5237L14.755 20.2554L14.5413 20.0479C13.1251 18.6734 10.8729 18.6734 9.45681 20.0479L9.24306 20.2554L6.25337 18.5237L6.33066 18.214C6.80681 16.3059 5.68552 14.3635 3.79497 13.8216L3.49902 13.7368ZM4.87529 6.15086C5.15577 7.27485 4.49528 8.41897 3.38167 8.73817L2.36125 9.03066C2.14681 9.09213 1.99902 9.28822 1.99902 9.51131L1.99902 14.4904C1.99902 14.7135 2.14681 14.9096 2.36125 14.9711L3.38166 15.2635C4.49527 15.5828 5.15576 16.7269 4.87528 17.8509L4.61578 18.8908C4.56183 19.107 4.65747 19.3328 4.8503 19.4445L9.14601 21.9327C9.33967 22.0448 9.58428 22.0146 9.74487 21.8588L10.5016 21.1243C11.3357 20.3146 12.6624 20.3146 13.4965 21.1243L14.2532 21.8588C14.4138 22.0146 14.6584 22.0448 14.8521 21.9326L19.1478 19.4445C19.3406 19.3328 19.4362 19.107 19.3823 18.8908L19.1228 17.8508C18.8423 16.7269 19.5028 15.5827 20.6164 15.2635L21.6368 14.9711C21.8512 14.9096 21.999 14.7135 21.999 14.4904L21.999 9.5113C21.999 9.28822 21.8512 9.09212 21.6368 9.03066L20.6164 8.73817C19.5028 8.41897 18.8423 7.27485 19.1228 6.15086L19.3823 5.11092C19.4362 4.89471 19.3406 4.66889 19.1477 4.5572L14.852 2.06906C14.6584 1.95689 14.4138 1.98707 14.2532 2.14295L13.4965 2.87742C12.6624 3.68709 11.3357 3.68709 10.5015 2.87742L9.74488 2.14296C9.58429 1.98708 9.33968 1.9569 9.14602 2.06907L4.85031 4.55721C4.65748 4.6689 4.56184 4.89472 4.61579 5.11093L4.87529 6.15086ZM9.49902 12C9.49902 10.6193 10.6183 9.5 11.999 9.5C13.3797 9.5 14.499 10.6193 14.499 12C14.499 13.3807 13.3797 14.5 11.999 14.5C10.6183 14.5 9.49902 13.3807 9.49902 12ZM7.99902 12C7.99902 9.79086 9.78988 8 11.999 8C14.2082 8 15.999 9.79086 15.999 12C15.999 14.2091 14.2082 16 11.999 16C9.78988 16 7.99902 14.2091 7.99902 12Z" fill="currentColor"/>
                                    </svg>
                                </span>
                                <p className="user-navigation__item__text">Настройки</p>
                            </div>
                            <div className='user-navigation__item'>
                                <span className="cb-icon cb-icon__size-24">
                                <svg width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
                                    <path fill-rule="evenodd" clip-rule="evenodd" d="M20.5 12C20.5 16.6944 16.6944 20.5 12 20.5C7.30558 20.5 3.5 16.6944 3.5 12C3.5 7.30558 7.30558 3.5 12 3.5C16.6944 3.5 20.5 7.30558 20.5 12ZM22 12C22 17.5228 17.5228 22 12 22C6.47715 22 2 17.5228 2 12C2 6.47715 6.47715 2 12 2C17.5228 2 22 6.47715 22 12ZM12.7502 14.088H10.9862V13.864C10.9862 13.01 11.2662 12.478 12.1902 11.736C13.1142 10.994 13.4782 10.504 13.4782 9.79C13.4782 9.062 12.8762 8.6 12.0222 8.6C11.1682 8.6 10.4402 9.118 10.4402 9.986C10.4402 10.168 10.4822 10.364 10.5382 10.504L8.9282 10.84C8.8022 10.574 8.7322 10.252 8.7322 9.832C8.7322 8.432 9.9782 7.004 11.9802 7.004C14.0102 7.004 15.2142 8.082 15.2142 9.664C15.2142 10.784 14.8082 11.47 13.4082 12.674C12.9042 13.108 12.7502 13.472 12.7502 14.088ZM12.7922 17H10.9442V15.068H12.7922V17Z" fill="currentColor"/>
                                    </svg>
                                </span>
                                <p className="user-navigation__item__text">Помощь</p>
                            </div>
                            <div className='user-navigation__item'>
                                <span className="cb-icon cb-icon__size-24">
                                <svg width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
                                    <path fill-rule="evenodd" clip-rule="evenodd" d="M8 4.5H15V3H8C6.34315 3 5 4.34315 5 6V18C5 19.6569 6.34315 21 8 21H15V19.5H8C7.17157 19.5 6.5 18.8284 6.5 18V6C6.5 5.17157 7.17157 4.5 8 4.5ZM14.1125 15.1836L15.1716 16.2426L16.2322 15.182L18.7071 12.7071C19.0976 12.3166 19.0976 11.6834 18.7071 11.2929L16.2322 8.81802L15.1716 7.75736L14.1125 8.81641L16.5461 11.25L9 11.25V12.75L16.5461 12.75L14.1125 15.1836Z" fill="currentColor"/>
                                    </svg>
                                </span>
                                <p className="user-navigation__item__text">Выход</p>
                            </div>
                            </div>
                        </li>
                        </ul>
                    </nav>
                </header>
                <main className="page-main">
                <div className="comments-page">
                <div className="dialogue">
                    <div className="dialogue__backdrop">&nbsp;</div>
                    <div className="dialogue__card">
                    <div className="dialogue__card-header">
                        <p className="dialogue__card-header-title">Отсутствие долгов</p>
                        <span className="cb-icon cb-icon__size-24">
                        <svg width="24" height="25" viewBox="0 0 24 25" fill="none" xmlns="http://www.w3.org/2000/svg">
                            <path fill-rule="evenodd" clip-rule="evenodd" d="M10.9394 12.9976L4.99805 18.9389L6.0587 19.9996L12.0001 14.0582L17.9414 19.9996L19.0021 18.9389L13.0607 12.9976L19.0015 7.05676L17.9408 5.99609L12.0001 11.9369L6.05927 5.99609L4.99861 7.05676L10.9394 12.9976Z" fill="currentColor"/>
                        </svg>
                        </span>
                    </div>
                    <div className="dialogue__card-body">
                        <div className="comments-page__dialogue">
                        <p className="comments-page__dialogue-text">Отсутствие у юридического лица недоимки по налогам, сборам, задолженности по иным обязательным платежам в бюджеты бюджетной системы Российской Федерации (за исключением сумм, на которые предоставлены отсрочка, рассрочка, инвестиционный налоговый кредит в соответствии с законодательством Российской Федерации о налогах и сборах, которые реструктурированы в соответствии с законодательством Российской Федерации, по которым имеется вступившее в законную силу решение суда о признании обязанности заявителя по уплате этих сумм исполненной или которые признаны безнадежными к взысканию в соответствии с законодательством Российской Федерации о налогах и сборах) за прошедший календарный год, размер которых превышает двадцать пять процентов балансовой стоимости активов юридического лица, по данным бухгалтерской отчетности за последний отчетный период. Юридическое лицо считается соответствующим установленному требованию в случае, если им в установленном порядке подано заявление об обжаловании указанных недоимки, задолженности и решение по такому заявлению на дату рассмотрения заявки на включение Сервиса в ЕЦП «ГосТех» не принято</p>
                        <div className="comments-page__dialogue-list">
                            <p className="comments-page__dialogue-headline">Комментарии</p>
                            <div className="comments-page__dialogue-item is-error">
                            <div className="comments-page__dialogue-header">
                                <div className="comments-page__dialogue-author">&nbsp;</div>
                                <p className="comments-page__dialogue-title">Татьяна Жилина</p>
                                <a href="" className="comments-page__dialogue-link">Удалить</a>
                            </div>
                            <div className="comments-page__dialogue-body">
                                <time dateTime="2023-09-30 20:00" className="comments-page__dialogue-time">30 сентября 20:00</time>
                                <p className="comments-page__dialogue-comment">Какой-то комментарий, отражающий положительную  или негативную обратную связь эксперта по отношению к документу, приложенному к цифровому продукту поставщика, например, ПАО Сбербанк.</p>
                                <a href="" className="comments-page__dialogue-link">Убрать из протокола</a>
                            </div>
                            </div>
                            <div className="comments-page__dialogue-item is-ok">
                            <div className="comments-page__dialogue-header">
                                <div className="comments-page__dialogue-author">&nbsp;</div>
                                <p className="comments-page__dialogue-title">Александр Сергеев</p>
                                <a href="" className="comments-page__dialogue-link">Удалить</a>
                            </div>
                            <div className="comments-page__dialogue-body">
                                <time dateTime="2023-09-30 20:00" className="comments-page__dialogue-time">30 сентября 20:00</time>
                                <p className="comments-page__dialogue-comment">Какой-то комментарий, отражающий положительную  или негативную обратную связь эксперта по отношению к документу, приложенному к цифровому продукту поставщика, например, ПАО Сбербанк.</p>
                                <a href="" className="comments-page__dialogue-link">Убрать из протокола</a>
                            </div>
                            </div>
                            <div className="comments-page__dialogue-item is-ok">
                            <div className="comments-page__dialogue-header">
                                <div className="comments-page__dialogue-author">&nbsp;</div>
                                <p className="comments-page__dialogue-title">Татьяна Жилина</p>
                                <a href="" className="comments-page__dialogue-link">Удалить</a>
                            </div>
                            <div className="comments-page__dialogue-body">
                                <time dateTime="2023-10-15 20:00" className="comments-page__dialogue-time">15 октября 20:00</time>
                                <p className="comments-page__dialogue-comment">Какой-то комментарий, отражающий положительную  или негативную обратную связь эксперта по отношению к документу, приложенному к цифровому продукту поставщика, например, ПАО Сбербанк.</p>
                                <a href="" className="comments-page__dialogue-link">Убрать из протокола</a>
                            </div>
                            </div>
                        </div>
                        <div className="cb-textarea">
                            <label className="cb-textarea__label">Написать комментарий</label>
                            <div className="cb-textarea__field">
                                <textarea className="cb-textarea__input"></textarea>
                                <div className="cb-textarea__group-data">
                                    <p className="cb-textarea__length">
                                        <span className="cb-textarea__current-length">255</span>
                                        <span className="cb-textarea__max-length">255</span>
                                    </p>
                                </div>
                            </div>
                        </div>
                        </div>
                    </div>
                    <div className="dialogue__card-footer">
                        <button className="cb-button">Сохранить</button>
                    </div>
                    </div>
                </div>
                <div className="comments-page__container">
                    <header className="comments-page__header">
                    <a href="" className="comments-page__link-back">Назад</a>
                    <div className="comments-page__header-row">
                        <p className="comments-page__title">Юридическая проверка</p>
                        <button className="cb-button">Сохранить</button>
                    </div>
                    <p className="comments-page__subtitle">Заявка № 417</p>
                    </header>
                    <div className="comments-page__inner">
                    <div className="comments-page__col">
                        <div className="cb-checkbox">
                        <label className="cb-checkbox__field">
                            <input className="cb-checkbox__input" type="checkbox"/>
                            <span className="cb-checkbox__flag">&nbsp;</span>
                            <span className="cb-checkbox__label">Принять все</span>
                        </label>
                        </div>
                        <div className="comments-page__list is-first-col">
                        <div className="comments-page__item is-ok">
                            <div className="comments-page__item-col">
                            <span className="comments-page__item-status">&nbsp;</span>
                            </div>
                            <div className="comments-page__item-col">
                            <header className="comments-page__item-header">
                                <p className="comments-page__item-title">Требование к гражданской правоспособности</p>
                                <div className="comments-page__item-chat">
                                <span className="cb-icon cb-icon__size-24">
                                    <svg width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
                                    <path fill-rule="evenodd" clip-rule="evenodd" d="M7 12.4893H6.64618L6.32966 12.6474L3.5 14.061L3.5 5C3.5 4.17157 4.17157 3.5 5 3.5L15 3.5C15.8284 3.5 16.5 4.17157 16.5 5V10.9893C16.5 11.8177 15.8284 12.4893 15 12.4893L7 12.4893ZM7.5 13.9893L7.5 16.9857C7.5 17.8141 8.17157 18.4857 9 18.4857L17 18.4857H17.3773L17.7097 18.6642L20.5 20.1627V10.9955C20.5 10.1671 19.8284 9.49554 19 9.49554H18V10.9893C18 12.6461 16.6569 13.9893 15 13.9893L7.5 13.9893ZM18 7.99554V5C18 3.34315 16.6569 2 15 2H5C3.34315 2 2 3.34314 2 5L2 14.8697C2 15.6129 2.78202 16.0964 3.4469 15.7642L6 14.4888V16.9857C6 18.6426 7.34315 19.9857 9 19.9857L17 19.9857L20.5269 21.8797C21.1931 22.2375 22 21.7549 22 20.9987V10.9955C22 9.33869 20.6569 7.99554 19 7.99554H18Z" fill="currentColor"/>
                                    </svg>
                                </span>
                                </div>
                            </header>
                            <div className="comments-page__item-body">
                                <p className="comments-page__item-text">Наличие общей или специальной гражданской правоспособности в полном объеме для заключения и исполнения государственного контракта (договора) по использованию Сервиса</p>
                                <div className="comments-page__item-row is-action">
                                <a href="" className="comments-page__item-link">Принять</a>
                                <a href="" className="comments-page__item-link">Отклонить</a>
                                </div>
                            </div>
                            <div className="comments-page__comment">
                                <div className="comments-page__comment-header">
                                <p className="comments-page__comment-label">Комментарий</p>
                                <span className="comments-page__comment-value">1</span>
                                </div>
                                <time dateTime="2023-09-25 20:00" className="comments-page__comment-time">25 сентября 20:00</time>
                                <div className="comments-page__comment-body">
                                <p className="comments-page__comment-author">AC</p>
                                <p className="comments-page__comment-text">Принято, с условием дозагрузки документа, указанного в п.3 Методических рекомендаций. Пожалуйста, по готовонсти документа напишите в общий чат. Как только документ будет проверен экспертом, вы получите уведомление и см</p>
                                </div>
                            </div>
                            <div className="comments-page__item-row">
                                <a href="" className="comments-page__item-link">Написать комментарий</a>
                                <a href="" className="comments-page__item-link">Подробнее</a>
                            </div>
                            </div>
                        </div>
                        <div className="comments-page__item is-error">
                            <div className="comments-page__item-col">
                            <span className="comments-page__item-status">&nbsp;</span>
                            </div>
                            <div className="comments-page__item-col">
                            <header className="comments-page__item-header">
                                <p className="comments-page__item-title">Требование к разработке</p>
                                <div className="comments-page__item-chat">
                                <span className="cb-icon cb-icon__size-24">
                                    <svg width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
                                    <path fill-rule="evenodd" clip-rule="evenodd" d="M7 12.4893H6.64618L6.32966 12.6474L3.5 14.061L3.5 5C3.5 4.17157 4.17157 3.5 5 3.5L15 3.5C15.8284 3.5 16.5 4.17157 16.5 5V10.9893C16.5 11.8177 15.8284 12.4893 15 12.4893L7 12.4893ZM7.5 13.9893L7.5 16.9857C7.5 17.8141 8.17157 18.4857 9 18.4857L17 18.4857H17.3773L17.7097 18.6642L20.5 20.1627V10.9955C20.5 10.1671 19.8284 9.49554 19 9.49554H18V10.9893C18 12.6461 16.6569 13.9893 15 13.9893L7.5 13.9893ZM18 7.99554V5C18 3.34315 16.6569 2 15 2H5C3.34315 2 2 3.34314 2 5L2 14.8697C2 15.6129 2.78202 16.0964 3.4469 15.7642L6 14.4888V16.9857C6 18.6426 7.34315 19.9857 9 19.9857L17 19.9857L20.5269 21.8797C21.1931 22.2375 22 21.7549 22 20.9987V10.9955C22 9.33869 20.6569 7.99554 19 7.99554H18Z" fill="currentColor"/>
                                    </svg>
                                </span>
                                </div>
                            </header>
                            <div className="comments-page__item-body">
                                <p className="comments-page__item-text">Соответствие требованиям, установленным в соответствии
                                с законодательством Российской Федерации при осуществлении разработки и производству средств защиты конфиденциальной информации, в рамках работпо созданию Сервисов, реализующих функционал СрЗИ</p>
                                <div className="comments-page__item-row is-action">
                                <a href="" className="comments-page__item-link">Принять</a>
                                <a href="" className="comments-page__item-link">Отклонить</a>
                                </div>
                            </div>
                            <div className="comments-page__comment">
                                <div className="comments-page__comment-header">
                                <p className="comments-page__comment-label">Комментарий</p>
                                <span className="comments-page__comment-value">3</span>
                                </div>
                                <time dateTime="2023-09-25 20:00" className="comments-page__comment-time">25 сентября 20:00</time>
                                <div className="comments-page__comment-body">
                                <p className="comments-page__comment-author">AC</p>
                                <p className="comments-page__comment-text">Просьба дозагрузить документ, указанный в п.3 Методических рекомендаций. Пожалуйста, по готовонсти документа напишите в общий чат. </p>
                                </div>
                            </div>
                            <div className="comments-page__item-row">
                                <a href="" className="comments-page__item-link">Написать комментарий</a>
                                <a href="" className="comments-page__item-link">Подробнее</a>
                            </div>
                            </div>
                        </div>
                        <div className="comments-page__item is-error">
                            <div className="comments-page__item-col"></div>
                            <div className="comments-page__item-col">
                            <header className="comments-page__item-header">
                                <p className="comments-page__item-title">Отсутствие признания о банкротстве</p>
                                <div className="comments-page__item-chat">
                                <span className="cb-icon cb-icon__size-24">
                                    <svg width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
                                    <path fill-rule="evenodd" clip-rule="evenodd" d="M7 12.4893H6.64618L6.32966 12.6474L3.5 14.061L3.5 5C3.5 4.17157 4.17157 3.5 5 3.5L15 3.5C15.8284 3.5 16.5 4.17157 16.5 5V10.9893C16.5 11.8177 15.8284 12.4893 15 12.4893L7 12.4893ZM7.5 13.9893L7.5 16.9857C7.5 17.8141 8.17157 18.4857 9 18.4857L17 18.4857H17.3773L17.7097 18.6642L20.5 20.1627V10.9955C20.5 10.1671 19.8284 9.49554 19 9.49554H18V10.9893C18 12.6461 16.6569 13.9893 15 13.9893L7.5 13.9893ZM18 7.99554V5C18 3.34315 16.6569 2 15 2H5C3.34315 2 2 3.34314 2 5L2 14.8697C2 15.6129 2.78202 16.0964 3.4469 15.7642L6 14.4888V16.9857C6 18.6426 7.34315 19.9857 9 19.9857L17 19.9857L20.5269 21.8797C21.1931 22.2375 22 21.7549 22 20.9987V10.9955C22 9.33869 20.6569 7.99554 19 7.99554H18Z" fill="currentColor"/>
                                    </svg>
                                </span>
                                </div>
                            </header>
                            <div className="comments-page__item-body">
                                <p className="comments-page__item-text">Непроведение ликвидации юридического лица и отсутствие решения арбитражного суда о признании юридического лица несостоятельным (банкротом) и об открытии конкурсного производства</p>
                                <div className="comments-page__item-row is-action">
                                <a href="" className="comments-page__item-link">Принять</a>
                                <a href="" className="comments-page__item-link">Отклонить</a>
                                </div>
                            </div>
                            <div className="comments-page__item-row">
                                <a href="" className="comments-page__item-link">Написать комментарий</a>
                            </div>
                            </div>
                        </div>
                        <div className="comments-page__item is-warning">
                            <div className="comments-page__item-col">
                            <span className="comments-page__item-status">&nbsp;</span>
                            </div>
                            <div className="comments-page__item-col">
                            <header className="comments-page__item-header">
                                <p className="comments-page__item-title">Отсутствие долгов</p>
                                <div className="comments-page__item-chat">
                                <span className="cb-icon cb-icon__size-24">
                                    <svg width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
                                    <path fill-rule="evenodd" clip-rule="evenodd" d="M7 12.4893H6.64618L6.32966 12.6474L3.5 14.061L3.5 5C3.5 4.17157 4.17157 3.5 5 3.5L15 3.5C15.8284 3.5 16.5 4.17157 16.5 5V10.9893C16.5 11.8177 15.8284 12.4893 15 12.4893L7 12.4893ZM7.5 13.9893L7.5 16.9857C7.5 17.8141 8.17157 18.4857 9 18.4857L17 18.4857H17.3773L17.7097 18.6642L20.5 20.1627V10.9955C20.5 10.1671 19.8284 9.49554 19 9.49554H18V10.9893C18 12.6461 16.6569 13.9893 15 13.9893L7.5 13.9893ZM18 7.99554V5C18 3.34315 16.6569 2 15 2H5C3.34315 2 2 3.34314 2 5L2 14.8697C2 15.6129 2.78202 16.0964 3.4469 15.7642L6 14.4888V16.9857C6 18.6426 7.34315 19.9857 9 19.9857L17 19.9857L20.5269 21.8797C21.1931 22.2375 22 21.7549 22 20.9987V10.9955C22 9.33869 20.6569 7.99554 19 7.99554H18Z" fill="currentColor"/>
                                    </svg>
                                </span>
                                </div>
                            </header>
                            <div className="comments-page__item-body">
                                <p className="comments-page__item-text">Отсутствие у юридического лица недоимки по налогам, сборам,
                                задолженности по иным обязательным платежам в бюджеты бюджетной системы Российской Федерации (за исключением сумм, на которые предоставлены отсрочка, рассрочка, инвестиционный налоговый кредит в соответствии с законодательством Российской Федерации о налогах и сборах, которые реструктурированы
                                в соответствии с законодательством Российской Федерации,
                                по которым имеется вступившее в законную силу решение суда
                                о признании обязанности заявителя по уплате этих сумм исполненной или которые признаны безнадежными к взысканию
                                в соответствии с законодательством Российской Федерации
                                о налогах и сборах) за прошедший календарный год, размер которых превышает двадцать пять процентов балансовой стоимости активов юридического лица, по данным бухгалтерской отчетности за последний отчетный период. Юридическое лицо считается соответствующим установленному требованию в случае, если им в установленном порядке подано заявление
                                об обжаловании указанных недоимки, задолженности и решение
                                по такому заявлению на дату рассмотрения заявки на включение Сервиса в ЕЦП «ГосТех» не принято</p>
                                <div className="comments-page__item-row is-action">
                                <a href="" className="comments-page__item-link">Принять</a>
                                <a href="" className="comments-page__item-link">Отклонить</a>
                                </div>
                            </div>
                            <div className="comments-page__item-row">
                                <a href="" className="comments-page__item-link">Написать комментарий</a>
                            </div>
                            </div>
                        </div>
                        </div>
                        <div className="comments-page__buttons">
                        <button className="cb-button is-disabled">Завершить проверку</button>
                        <button className="cb-button cb-button-contour">Отмена</button>
                        </div>
                    </div>
                    <div className="comments-page__col">
                        <div className="comments-page__informer is-positive">
                        <div className="comments-page__informer-status">
                            <span className="cb-icon cb-icon__size-24">
                            <svg width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
                                <path d="M1 13.5L7.5 20L23 4.5" stroke="currentColor" stroke-width="1.5" stroke-linecap="round" stroke-linejoin="round"/>
                            </svg>
                            </span>
                        </div>
                        <div className="comments-page__informer-body">
                            <p className="comments-page__informer-title">ПМИ согласовано</p>
                            <p className="comments-page__informer-author">Константинпольский К.В.</p>
                            <time dateTime="2023-09-12 12:30" className="comments-page__informer-time">12 сен 2023 в 12:30.</time>
                        </div>
                        </div>
                        <div className="comments-page__card">
                        <div className="comments-page__card-header">
                            <p className="comments-page__card-title">ПАО Сбербанк</p>
                            <span className="cb-icon cb-icon__size-24">
                            <svg width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
                                <path fill-rule="evenodd" clip-rule="evenodd" d="M12 16.3077L12.6945 16.6704L17.5 19.1805V5C17.5 4.72386 17.2761 4.5 17 4.5H7C6.72386 4.5 6.5 4.72386 6.5 5V19.1805L11.3055 16.6704L12 16.3077ZM12 18L17.537 20.8921C18.2028 21.2399 19 20.7569 19 20.0057V5C19 3.89543 18.1046 3 17 3H7C5.89543 3 5 3.89543 5 5V20.0057C5 20.7569 5.79719 21.2399 6.46297 20.8921L12 18Z" fill="currentColor"/>
                            </svg>
                            </span>
                        </div>
                        <div className="comments-page__card-description">
                            <p className="comments-page__card-subtitle">Помощник формирования цены</p>
                            <p className="comments-page__card-text-helper">Дополнительный сервис платформы</p>
                        </div>
                        <div className="comments-page__card-info">
                            <p className="comments-page__card-subtitle">ПАО Сбербанк</p>
                            <div className="comments-page__card-row">
                            <p className="comments-page__card-text-helper">№ в реестре 8678</p>
                            <span className="cb-icon cb-icon__size-24">
                                <svg width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
                                <path fill-rule="evenodd" clip-rule="evenodd" d="M8 6H4C3.44772 6 3 6.44772 3 7V21C3 21.5523 3.44772 22 4 22H15C15.5523 22 16 21.5523 16 21V18H20C20.5523 18 21 17.5523 21 17V5C21 3.34315 19.6569 2 18 2H9C8.44772 2 8 2.44772 8 3V6ZM9.5 6H13C14.6569 6 16 7.34315 16 9V16.5H19.5V5C19.5 4.17157 18.8284 3.5 18 3.5H9.5V6ZM4.5 20.5V7.5H13C13.8284 7.5 14.5 8.17157 14.5 9V20.5H4.5Z" fill="currentColor"/>
                                </svg>
                            </span>
                            </div>
                            <div className="comments-page__card-row is-space-between">
                            <p className="comments-page__card-text-helper">Дата регистрации  25 авг 2020 г</p>
                            <a href="" className="comments-page__card-link">Подробнее</a>
                            </div>
                        </div>
                        <div className="comments-page__card-list">
                            <a href="#" className="comments-page__quiz is-color is-point">
                            <p className="comments-page__quiz-title">Эксперты
                                <span className="cb-icon cb-icon-quiz cb-icon__size-24">
                                    <svg width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
                                        <path d="M9.21072 4.39382C8.70499 3.86873 7.88503 3.86873 7.3793 4.39382C6.87357 4.91892 6.87357 5.77027 7.3793 6.29536L13.7893 12.9508C14.295 13.4759 15.115 13.4759 15.6207 12.9508C16.1264 12.4257 16.1264 11.5743 15.6207 11.0492L9.21072 4.39382Z" fill="currentColor"/>
                                        <path d="M7.3795 17.7046C6.87376 18.2297 6.87376 19.0811 7.3795 19.6062C7.88523 20.1313 8.70519 20.1313 9.21092 19.6062L15.6207 12.9508C16.1264 12.4257 16.1264 11.5743 15.6207 11.0492C15.115 10.5241 14.2952 10.5241 13.7895 11.0492L7.3795 17.7046Z" fill="currentColor"/>
                                    </svg>
                                </span>
                            </p>
                            </a>
                            <a href="#" className="comments-page__quiz is-color">
                            <p className="comments-page__quiz-title">Манифест
                                <span className="cb-icon cb-icon-quiz cb-icon__size-24">
                                    <svg width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
                                        <path d="M9.21072 4.39382C8.70499 3.86873 7.88503 3.86873 7.3793 4.39382C6.87357 4.91892 6.87357 5.77027 7.3793 6.29536L13.7893 12.9508C14.295 13.4759 15.115 13.4759 15.6207 12.9508C16.1264 12.4257 16.1264 11.5743 15.6207 11.0492L9.21072 4.39382Z" fill="currentColor"/>
                                        <path d="M7.3795 17.7046C6.87376 18.2297 6.87376 19.0811 7.3795 19.6062C7.88523 20.1313 8.70519 20.1313 9.21092 19.6062L15.6207 12.9508C16.1264 12.4257 16.1264 11.5743 15.6207 11.0492C15.115 10.5241 14.2952 10.5241 13.7895 11.0492L7.3795 17.7046Z" fill="currentColor"/>
                                    </svg>
                                </span>
                            </p>
                            </a>
                            <a href="#" className="comments-page__quiz is-color">
                            <p className="comments-page__quiz-title">Документы
                                <span className="cb-icon cb-icon-quiz cb-icon__size-24">
                                    <svg width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
                                        <path d="M9.21072 4.39382C8.70499 3.86873 7.88503 3.86873 7.3793 4.39382C6.87357 4.91892 6.87357 5.77027 7.3793 6.29536L13.7893 12.9508C14.295 13.4759 15.115 13.4759 15.6207 12.9508C16.1264 12.4257 16.1264 11.5743 15.6207 11.0492L9.21072 4.39382Z" fill="currentColor"/>
                                        <path d="M7.3795 17.7046C6.87376 18.2297 6.87376 19.0811 7.3795 19.6062C7.88523 20.1313 8.70519 20.1313 9.21092 19.6062L15.6207 12.9508C16.1264 12.4257 16.1264 11.5743 15.6207 11.0492C15.115 10.5241 14.2952 10.5241 13.7895 11.0492L7.3795 17.7046Z" fill="currentColor"/>
                                    </svg>
                                </span>
                            </p>
                            </a>
                            <a href="#" className="comments-page__quiz is-color is-point">
                            <p className="comments-page__quiz-title">Чат с поставщиком
                                <span className="cb-icon cb-icon-quiz cb-icon__size-24">
                                    <svg width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
                                        <path d="M9.21072 4.39382C8.70499 3.86873 7.88503 3.86873 7.3793 4.39382C6.87357 4.91892 6.87357 5.77027 7.3793 6.29536L13.7893 12.9508C14.295 13.4759 15.115 13.4759 15.6207 12.9508C16.1264 12.4257 16.1264 11.5743 15.6207 11.0492L9.21072 4.39382Z" fill="currentColor"/>
                                        <path d="M7.3795 17.7046C6.87376 18.2297 6.87376 19.0811 7.3795 19.6062C7.88523 20.1313 8.70519 20.1313 9.21092 19.6062L15.6207 12.9508C16.1264 12.4257 16.1264 11.5743 15.6207 11.0492C15.115 10.5241 14.2952 10.5241 13.7895 11.0492L7.3795 17.7046Z" fill="currentColor"/>
                                    </svg>
                                </span>
                            </p>
                            </a>
                        </div>
                        </div>
                        <div className="comments-page__card is-inner">
                        <div className="comments-page__card-header">
                            <a href="" className="comments-page__card-link-back">Назад</a>
                            <p className="comments-page__card-title">Манифест</p>
                        </div>
                        <div className="comments-page__card-edit">
                            <span className="cb-icon cb-icon__size-24">
                            <svg width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
                                <path fill-rule="evenodd" clip-rule="evenodd" d="M18.2407 5.87026L17.2857 4.82827C16.9165 4.42546 16.2924 4.39354 15.884 4.75657L14.3213 6.14595L16.6194 8.68301L18.1714 7.29013C18.5854 6.91852 18.6166 6.28042 18.2407 5.87026ZM5.5 13.9885L13.2002 7.14264L15.5031 9.68493L7.90674 16.5027H5.5V13.9885ZM19.3465 4.85678L18.3915 3.81479C17.4686 2.80777 15.9083 2.72795 14.8874 3.63555L4.33557 13.0166C4.12212 13.2064 4 13.4783 4 13.764V17.0027C4 17.555 4.44772 18.0027 5 18.0027H8.09822C8.34478 18.0027 8.58266 17.9116 8.76616 17.7469L19.1733 8.40645C20.2084 7.47742 20.2863 5.88217 19.3465 4.85678ZM20 19.5001H4V21.0001H20V19.5001Z" fill="currentColor"/>
                            </svg>
                            </span>
                        </div>
                        <div className="comments-page__description">
                            <p className="comments-page__description-title">Описание сервиса</p>
                            <div className="comments-page__description-list">
                            <div className="comments-page__description-item">
                                <p className="comments-page__description-label">Идентификатор ЦП</p>
                                <p className="comments-page__description-value">Service 767</p>
                            </div>
                            <div className="comments-page__description-item">
                                <p className="comments-page__description-label">Наименование</p>
                                <p className="comments-page__description-value">Система исполнения услуг и межведомственного взаимодействтия КСК.СИУМВВ</p>
                            </div>
                            <div className="comments-page__description-item">
                                <p className="comments-page__description-label">Вид</p>
                                <p className="comments-page__description-value">Правительство Липецкой области</p>
                            </div>
                            <div className="comments-page__description-item">
                                <p className="comments-page__description-label">Версия</p>
                                <p className="comments-page__description-value">Региональный орган исполнительн</p>
                            </div>
                            <div className="comments-page__description-item">
                                <p className="comments-page__description-label">Страница</p>
                                <p className="comments-page__description-value">12549856324</p>
                            </div>
                            <div className="comments-page__description-item">
                                <p className="comments-page__description-label">Описание</p>
                                <p className="comments-page__description-value">2135487965</p>
                            </div>
                            <div className="comments-page__description-item">
                                <p className="comments-page__description-label">Ключевые слова</p>
                                <p className="comments-page__description-value">Андрейновский Константин</p>
                            </div>
                            <div className="comments-page__description-item">
                                <p className="comments-page__description-label">Документация</p>
                                <p className="comments-page__description-value">Andreynovskii.Kostik75@ryandex.ru</p>
                            </div>
                            </div>
                        </div>
                        <div className="comments-page__description">
                            <p className="comments-page__description-title">Данные о лицензии</p>
                            <div className="comments-page__description-list">
                            <div className="comments-page__description-item">
                                <p className="comments-page__description-label">Вид</p>
                                <p className="comments-page__description-value">https://guides.gosuslugi.ru/</p>
                            </div>
                            <div className="comments-page__description-item">
                                <p className="comments-page__description-label">Ссылка</p>
                                <p className="comments-page__description-value">https://guides.gosuslugi.ru/</p>
                            </div>
                            </div>
                        </div>
                        </div>
                        <div className="comments-page__card is-inner">
                        <div className="comments-page__card-header">
                            <a href="" className="comments-page__card-link-back">Назад</a>
                            <p className="comments-page__card-title">Документы</p>
                        </div>
                        <div className="comments-page__files">
                            <p className="comments-page__files-title">Новые</p>
                            <div className="comments-page__files-list">
                            <div className="comments-page__files-item">
                                <div className="comments-page__files-icon">
                                <span className="cb-icon cb-icon__size-48">
                                    <svg width="48" height="24" viewBox="0 0 48 24" fill="none" xmlns="http://www.w3.org/2000/svg">
                                    <path d="M6.98555 24C3.89359 24 1.97073 20.6418 3.53589 17.9752L11.1809 4.9504C12.6173 2.50318 15.2426 1 18.0802 1H43.9996C46.2087 1 47.9996 2.79086 47.9996 5V20C47.9996 22.2091 46.2087 24 43.9996 24H6.98555Z" fill="#FF8A00"/>
                                    <path d="M19.9025 14.4379V18.0009H18.0195V7.87891H21.3095C21.9861 7.87891 22.5718 7.95824 23.0665 8.11691C23.5611 8.27558 23.9695 8.49724 24.2915 8.78191C24.6135 9.06658 24.8515 9.40724 25.0055 9.80391C25.1641 10.2006 25.2435 10.6346 25.2435 11.1059C25.2435 11.5959 25.1618 12.0462 24.9985 12.4569C24.8351 12.8629 24.5901 13.2129 24.2635 13.5069C23.9368 13.8009 23.5261 14.0296 23.0315 14.1929C22.5415 14.3562 21.9675 14.4379 21.3095 14.4379H19.9025ZM19.9025 12.9679H21.3095C21.6548 12.9679 21.9558 12.9259 22.2125 12.8419C22.4691 12.7532 22.6815 12.6296 22.8495 12.4709C23.0221 12.3076 23.1505 12.1116 23.2345 11.8829C23.3185 11.6496 23.3605 11.3906 23.3605 11.1059C23.3605 10.8352 23.3185 10.5902 23.2345 10.3709C23.1505 10.1516 23.0245 9.96491 22.8565 9.81091C22.6885 9.65691 22.4761 9.54024 22.2195 9.46091C21.9628 9.37691 21.6595 9.33491 21.3095 9.33491H19.9025V12.9679Z" fill="white"/>
                                    <path d="M35.6052 12.9399C35.6052 13.6819 35.4816 14.3632 35.2342 14.9839C34.9869 15.6046 34.6392 16.1389 34.1912 16.5869C33.7432 17.0349 33.2042 17.3826 32.5742 17.6299C31.9442 17.8772 31.2442 18.0009 30.4742 18.0009H26.6172V7.87891H30.4742C31.2442 7.87891 31.9442 8.00491 32.5742 8.25691C33.2042 8.50424 33.7432 8.85191 34.1912 9.29991C34.6392 9.74324 34.9869 10.2752 35.2342 10.8959C35.4816 11.5166 35.6052 12.1979 35.6052 12.9399ZM33.6732 12.9399C33.6732 12.3846 33.5986 11.8876 33.4492 11.4489C33.3046 11.0056 33.0922 10.6322 32.8122 10.3289C32.5369 10.0209 32.2009 9.78524 31.8042 9.62191C31.4122 9.45858 30.9689 9.37691 30.4742 9.37691H28.5072V16.5029H30.4742C30.9689 16.5029 31.4122 16.4212 31.8042 16.2579C32.2009 16.0946 32.5369 15.8612 32.8122 15.5579C33.0922 15.2499 33.3046 14.8766 33.4492 14.4379C33.5986 13.9946 33.6732 13.4952 33.6732 12.9399Z" fill="white"/>
                                    <path d="M43.5813 7.87891V9.37691H39.0873V12.3729H42.8813V13.8779H39.0873V18.0009H37.1973V7.87891H43.5813Z" fill="white"/>
                                    </svg>
                                </span>
                                </div>
                                <div className="comments-page__files-text">
                                <p className="comments-page__files-link">Документ №1</p>
                                <time dateTime="2023-02-10 11:30" className="comments-page__files-time">10 фев в 11:30</time>
                                </div>
                                <div className="comments-page__files-action">
                                <span className="cb-icon cb-icon__size-24">
                                    <svg width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
                                    <path fill-rule="evenodd" clip-rule="evenodd" d="M12.7498 7L12.7498 4H11.2498L11.2498 7H12.7498ZM18.4869 8.49525L19.9869 5.99525L18.7007 5.2235L17.2007 7.7235L18.4869 8.49525ZM4.01291 5.99525L5.51291 8.49525L6.79915 7.7235L5.29915 5.2235L4.01291 5.99525ZM4.67903 14.0007C6.33005 16.1178 8.98814 17.5009 11.9988 17.5009C15.0098 17.5009 17.6681 16.1176 19.3191 14.0001C18.2829 12.6715 16.8502 11.632 15.1826 11.042C15.3862 11.4859 15.4998 11.9797 15.4998 12.5C15.4998 14.433 13.9328 16 11.9998 16C10.0668 16 8.49979 14.433 8.49979 12.5C8.49979 11.9795 8.61341 11.4855 8.8172 11.0416C7.14882 11.6316 5.71544 12.6715 4.67903 14.0007ZM20.8665 13.5758C18.9709 10.8131 15.7009 9.00011 11.9996 9H11.9993C8.29751 9 5.02716 10.8133 3.13155 13.5765C2.95614 13.8322 2.95615 14.1694 3.13158 14.4251C5.02727 17.1878 8.29738 19.0009 11.9988 19.0009C15.7006 19.0009 18.9709 17.1875 20.8665 14.4244C21.0419 14.1687 21.0419 13.8314 20.8665 13.5758ZM11.9998 14.5C13.1044 14.5 13.9998 13.6046 13.9998 12.5C13.9998 11.3954 13.1044 10.5 11.9998 10.5C10.8952 10.5 9.99979 11.3954 9.99979 12.5C9.99979 13.6046 10.8952 14.5 11.9998 14.5Z" fill="currentColor"/>
                                    </svg>
                                </span>
                                <span className="cb-icon cb-icon__size-24">
                                    <svg width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
                                    <path fill-rule="evenodd" clip-rule="evenodd" d="M8 4.5H16C16.2761 4.5 16.5 4.72386 16.5 5V7H7.5V5C7.5 4.72386 7.72386 4.5 8 4.5ZM18 5V7H19C20.6569 7 22 8.34315 22 10V16C22 17.6569 20.6569 19 19 19H18C18 20.1046 17.1046 21 16 21H8C6.89543 21 6 20.1046 6 19H5C3.34315 19 2 17.6569 2 16V10C2 8.34315 3.34315 7 5 7H6V5C6 3.89543 6.89543 3 8 3H16C17.1046 3 18 3.89543 18 5ZM6 17.5V13C6 12.4477 6.44771 12 7 12H17C17.5523 12 18 12.4477 18 13V17.5H19C19.8284 17.5 20.5 16.8284 20.5 16V10C20.5 9.17157 19.8284 8.5 19 8.5H5C4.17157 8.5 3.5 9.17157 3.5 10V16C3.5 16.8284 4.17157 17.5 5 17.5H6ZM8 19.5H16C16.2761 19.5 16.5 19.2761 16.5 19V13.5H7.5V19C7.5 19.2761 7.72386 19.5 8 19.5Z" fill="currentColor"/>
                                    </svg>
                                </span>
                                </div>
                            </div>
                            <div className="comments-page__files-item">
                                <div className="comments-page__files-icon">
                                <span className="cb-icon cb-icon__size-48">
                                    <svg width="48" height="24" viewBox="0 0 48 24" fill="none" xmlns="http://www.w3.org/2000/svg">
                                    <path d="M6.98555 24C3.89359 24 1.97073 20.6418 3.53589 17.9752L11.1809 4.9504C12.6173 2.50318 15.2426 1 18.0802 1H43.9996C46.2087 1 47.9996 2.79086 47.9996 5V20C47.9996 22.2091 46.2087 24 43.9996 24H6.98555Z" fill="#FF8A00"/>
                                    <path d="M19.9025 14.4379V18.0009H18.0195V7.87891H21.3095C21.9861 7.87891 22.5718 7.95824 23.0665 8.11691C23.5611 8.27558 23.9695 8.49724 24.2915 8.78191C24.6135 9.06658 24.8515 9.40724 25.0055 9.80391C25.1641 10.2006 25.2435 10.6346 25.2435 11.1059C25.2435 11.5959 25.1618 12.0462 24.9985 12.4569C24.8351 12.8629 24.5901 13.2129 24.2635 13.5069C23.9368 13.8009 23.5261 14.0296 23.0315 14.1929C22.5415 14.3562 21.9675 14.4379 21.3095 14.4379H19.9025ZM19.9025 12.9679H21.3095C21.6548 12.9679 21.9558 12.9259 22.2125 12.8419C22.4691 12.7532 22.6815 12.6296 22.8495 12.4709C23.0221 12.3076 23.1505 12.1116 23.2345 11.8829C23.3185 11.6496 23.3605 11.3906 23.3605 11.1059C23.3605 10.8352 23.3185 10.5902 23.2345 10.3709C23.1505 10.1516 23.0245 9.96491 22.8565 9.81091C22.6885 9.65691 22.4761 9.54024 22.2195 9.46091C21.9628 9.37691 21.6595 9.33491 21.3095 9.33491H19.9025V12.9679Z" fill="white"/>
                                    <path d="M35.6052 12.9399C35.6052 13.6819 35.4816 14.3632 35.2342 14.9839C34.9869 15.6046 34.6392 16.1389 34.1912 16.5869C33.7432 17.0349 33.2042 17.3826 32.5742 17.6299C31.9442 17.8772 31.2442 18.0009 30.4742 18.0009H26.6172V7.87891H30.4742C31.2442 7.87891 31.9442 8.00491 32.5742 8.25691C33.2042 8.50424 33.7432 8.85191 34.1912 9.29991C34.6392 9.74324 34.9869 10.2752 35.2342 10.8959C35.4816 11.5166 35.6052 12.1979 35.6052 12.9399ZM33.6732 12.9399C33.6732 12.3846 33.5986 11.8876 33.4492 11.4489C33.3046 11.0056 33.0922 10.6322 32.8122 10.3289C32.5369 10.0209 32.2009 9.78524 31.8042 9.62191C31.4122 9.45858 30.9689 9.37691 30.4742 9.37691H28.5072V16.5029H30.4742C30.9689 16.5029 31.4122 16.4212 31.8042 16.2579C32.2009 16.0946 32.5369 15.8612 32.8122 15.5579C33.0922 15.2499 33.3046 14.8766 33.4492 14.4379C33.5986 13.9946 33.6732 13.4952 33.6732 12.9399Z" fill="white"/>
                                    <path d="M43.5813 7.87891V9.37691H39.0873V12.3729H42.8813V13.8779H39.0873V18.0009H37.1973V7.87891H43.5813Z" fill="white"/>
                                    </svg>
                                </span>
                                </div>
                                <div className="comments-page__files-text">
                                <p className="comments-page__files-link">Документ №1</p>
                                <time dateTime="2023-02-10 11:30" className="comments-page__files-time">10 фев в 11:30</time>
                                </div>
                                <div className="comments-page__files-action">
                                <span className="cb-icon cb-icon__size-24">
                                    <svg width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
                                    <path fill-rule="evenodd" clip-rule="evenodd" d="M12.7498 7L12.7498 4H11.2498L11.2498 7H12.7498ZM18.4869 8.49525L19.9869 5.99525L18.7007 5.2235L17.2007 7.7235L18.4869 8.49525ZM4.01291 5.99525L5.51291 8.49525L6.79915 7.7235L5.29915 5.2235L4.01291 5.99525ZM4.67903 14.0007C6.33005 16.1178 8.98814 17.5009 11.9988 17.5009C15.0098 17.5009 17.6681 16.1176 19.3191 14.0001C18.2829 12.6715 16.8502 11.632 15.1826 11.042C15.3862 11.4859 15.4998 11.9797 15.4998 12.5C15.4998 14.433 13.9328 16 11.9998 16C10.0668 16 8.49979 14.433 8.49979 12.5C8.49979 11.9795 8.61341 11.4855 8.8172 11.0416C7.14882 11.6316 5.71544 12.6715 4.67903 14.0007ZM20.8665 13.5758C18.9709 10.8131 15.7009 9.00011 11.9996 9H11.9993C8.29751 9 5.02716 10.8133 3.13155 13.5765C2.95614 13.8322 2.95615 14.1694 3.13158 14.4251C5.02727 17.1878 8.29738 19.0009 11.9988 19.0009C15.7006 19.0009 18.9709 17.1875 20.8665 14.4244C21.0419 14.1687 21.0419 13.8314 20.8665 13.5758ZM11.9998 14.5C13.1044 14.5 13.9998 13.6046 13.9998 12.5C13.9998 11.3954 13.1044 10.5 11.9998 10.5C10.8952 10.5 9.99979 11.3954 9.99979 12.5C9.99979 13.6046 10.8952 14.5 11.9998 14.5Z" fill="currentColor"/>
                                    </svg>
                                </span>
                                <span className="cb-icon cb-icon__size-24">
                                    <svg width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
                                    <path fill-rule="evenodd" clip-rule="evenodd" d="M8 4.5H16C16.2761 4.5 16.5 4.72386 16.5 5V7H7.5V5C7.5 4.72386 7.72386 4.5 8 4.5ZM18 5V7H19C20.6569 7 22 8.34315 22 10V16C22 17.6569 20.6569 19 19 19H18C18 20.1046 17.1046 21 16 21H8C6.89543 21 6 20.1046 6 19H5C3.34315 19 2 17.6569 2 16V10C2 8.34315 3.34315 7 5 7H6V5C6 3.89543 6.89543 3 8 3H16C17.1046 3 18 3.89543 18 5ZM6 17.5V13C6 12.4477 6.44771 12 7 12H17C17.5523 12 18 12.4477 18 13V17.5H19C19.8284 17.5 20.5 16.8284 20.5 16V10C20.5 9.17157 19.8284 8.5 19 8.5H5C4.17157 8.5 3.5 9.17157 3.5 10V16C3.5 16.8284 4.17157 17.5 5 17.5H6ZM8 19.5H16C16.2761 19.5 16.5 19.2761 16.5 19V13.5H7.5V19C7.5 19.2761 7.72386 19.5 8 19.5Z" fill="currentColor"/>
                                    </svg>
                                </span>
                                </div>
                            </div>
                            <div className="comments-page__files-item">
                                <div className="comments-page__files-icon">
                                <span className="cb-icon cb-icon__size-48">
                                    <svg width="48" height="24" viewBox="0 0 48 24" fill="none" xmlns="http://www.w3.org/2000/svg">
                                    <path d="M6.98555 24C3.89359 24 1.97073 20.6418 3.53589 17.9752L11.1809 4.9504C12.6173 2.50318 15.2426 1 18.0802 1H43.9996C46.2087 1 47.9996 2.79086 47.9996 5V20C47.9996 22.2091 46.2087 24 43.9996 24H6.98555Z" fill="#9DACCE"/>
                                    <path d="M30.5182 7.87891V8.57191C30.5182 8.78658 30.4576 8.98258 30.3362 9.15991L25.1422 16.4959H30.3992V18.0009H22.6992V17.2589C22.6992 17.1656 22.7156 17.0769 22.7482 16.9929C22.7809 16.9042 22.8229 16.8226 22.8742 16.7479L28.0822 9.37691H23.0282V7.87891H30.5182Z" fill="white"/>
                                    <path d="M34.0521 18.0009H32.1621V7.87891H34.0521V18.0009Z" fill="white"/>
                                    <path d="M38.342 14.4379V18.0009H36.459V7.87891H39.749C40.4257 7.87891 41.0114 7.95824 41.506 8.11691C42.0007 8.27558 42.409 8.49724 42.731 8.78191C43.053 9.06658 43.291 9.40724 43.445 9.80391C43.6037 10.2006 43.683 10.6346 43.683 11.1059C43.683 11.5959 43.6014 12.0462 43.438 12.4569C43.2747 12.8629 43.0297 13.2129 42.703 13.5069C42.3764 13.8009 41.9657 14.0296 41.471 14.1929C40.981 14.3562 40.407 14.4379 39.749 14.4379H38.342ZM38.342 12.9679H39.749C40.0944 12.9679 40.3954 12.9259 40.652 12.8419C40.9087 12.7532 41.121 12.6296 41.289 12.4709C41.4617 12.3076 41.59 12.1116 41.674 11.8829C41.758 11.6496 41.8 11.3906 41.8 11.1059C41.8 10.8352 41.758 10.5902 41.674 10.3709C41.59 10.1516 41.464 9.96491 41.296 9.81091C41.128 9.65691 40.9157 9.54024 40.659 9.46091C40.4024 9.37691 40.099 9.33491 39.749 9.33491H38.342V12.9679Z" fill="white"/>
                                    </svg>
                                </span>
                                </div>
                                <div className="comments-page__files-text">
                                <p className="comments-page__files-link">Документ №1</p>
                                <time dateTime="2023-02-10 11:30" className="comments-page__files-time">10 фев в 11:30</time>
                                </div>
                                <div className="comments-page__files-action">
                                <span className="cb-icon cb-icon__size-24">
                                    <svg width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
                                    <path fill-rule="evenodd" clip-rule="evenodd" d="M12.7498 7L12.7498 4H11.2498L11.2498 7H12.7498ZM18.4869 8.49525L19.9869 5.99525L18.7007 5.2235L17.2007 7.7235L18.4869 8.49525ZM4.01291 5.99525L5.51291 8.49525L6.79915 7.7235L5.29915 5.2235L4.01291 5.99525ZM4.67903 14.0007C6.33005 16.1178 8.98814 17.5009 11.9988 17.5009C15.0098 17.5009 17.6681 16.1176 19.3191 14.0001C18.2829 12.6715 16.8502 11.632 15.1826 11.042C15.3862 11.4859 15.4998 11.9797 15.4998 12.5C15.4998 14.433 13.9328 16 11.9998 16C10.0668 16 8.49979 14.433 8.49979 12.5C8.49979 11.9795 8.61341 11.4855 8.8172 11.0416C7.14882 11.6316 5.71544 12.6715 4.67903 14.0007ZM20.8665 13.5758C18.9709 10.8131 15.7009 9.00011 11.9996 9H11.9993C8.29751 9 5.02716 10.8133 3.13155 13.5765C2.95614 13.8322 2.95615 14.1694 3.13158 14.4251C5.02727 17.1878 8.29738 19.0009 11.9988 19.0009C15.7006 19.0009 18.9709 17.1875 20.8665 14.4244C21.0419 14.1687 21.0419 13.8314 20.8665 13.5758ZM11.9998 14.5C13.1044 14.5 13.9998 13.6046 13.9998 12.5C13.9998 11.3954 13.1044 10.5 11.9998 10.5C10.8952 10.5 9.99979 11.3954 9.99979 12.5C9.99979 13.6046 10.8952 14.5 11.9998 14.5Z" fill="currentColor"/>
                                    </svg>
                                </span>
                                <span className="cb-icon cb-icon__size-24">
                                    <svg width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
                                    <path fill-rule="evenodd" clip-rule="evenodd" d="M8 4.5H16C16.2761 4.5 16.5 4.72386 16.5 5V7H7.5V5C7.5 4.72386 7.72386 4.5 8 4.5ZM18 5V7H19C20.6569 7 22 8.34315 22 10V16C22 17.6569 20.6569 19 19 19H18C18 20.1046 17.1046 21 16 21H8C6.89543 21 6 20.1046 6 19H5C3.34315 19 2 17.6569 2 16V10C2 8.34315 3.34315 7 5 7H6V5C6 3.89543 6.89543 3 8 3H16C17.1046 3 18 3.89543 18 5ZM6 17.5V13C6 12.4477 6.44771 12 7 12H17C17.5523 12 18 12.4477 18 13V17.5H19C19.8284 17.5 20.5 16.8284 20.5 16V10C20.5 9.17157 19.8284 8.5 19 8.5H5C4.17157 8.5 3.5 9.17157 3.5 10V16C3.5 16.8284 4.17157 17.5 5 17.5H6ZM8 19.5H16C16.2761 19.5 16.5 19.2761 16.5 19V13.5H7.5V19C7.5 19.2761 7.72386 19.5 8 19.5Z" fill="currentColor"/>
                                    </svg>
                                </span>
                                </div>
                            </div>
                            </div>
                        </div>
                        <div className="comments-page__files">
                            <p className="comments-page__files-title">Прочие</p>
                            <div className="comments-page__files-list">
                            <div className="comments-page__files-item">
                                <div className="comments-page__files-icon">
                                <span className="cb-icon cb-icon__size-48">
                                    <svg width="48" height="24" viewBox="0 0 48 24" fill="none" xmlns="http://www.w3.org/2000/svg">
                                    <path d="M6.98555 24C3.89359 24 1.97073 20.6418 3.53589 17.9752L11.1809 4.9504C12.6173 2.50318 15.2426 1 18.0802 1H43.9996C46.2087 1 47.9996 2.79086 47.9996 5V20C47.9996 22.2091 46.2087 24 43.9996 24H6.98555Z" fill="#FF8A00"/>
                                    <path d="M19.9025 14.4379V18.0009H18.0195V7.87891H21.3095C21.9861 7.87891 22.5718 7.95824 23.0665 8.11691C23.5611 8.27558 23.9695 8.49724 24.2915 8.78191C24.6135 9.06658 24.8515 9.40724 25.0055 9.80391C25.1641 10.2006 25.2435 10.6346 25.2435 11.1059C25.2435 11.5959 25.1618 12.0462 24.9985 12.4569C24.8351 12.8629 24.5901 13.2129 24.2635 13.5069C23.9368 13.8009 23.5261 14.0296 23.0315 14.1929C22.5415 14.3562 21.9675 14.4379 21.3095 14.4379H19.9025ZM19.9025 12.9679H21.3095C21.6548 12.9679 21.9558 12.9259 22.2125 12.8419C22.4691 12.7532 22.6815 12.6296 22.8495 12.4709C23.0221 12.3076 23.1505 12.1116 23.2345 11.8829C23.3185 11.6496 23.3605 11.3906 23.3605 11.1059C23.3605 10.8352 23.3185 10.5902 23.2345 10.3709C23.1505 10.1516 23.0245 9.96491 22.8565 9.81091C22.6885 9.65691 22.4761 9.54024 22.2195 9.46091C21.9628 9.37691 21.6595 9.33491 21.3095 9.33491H19.9025V12.9679Z" fill="white"/>
                                    <path d="M35.6052 12.9399C35.6052 13.6819 35.4816 14.3632 35.2342 14.9839C34.9869 15.6046 34.6392 16.1389 34.1912 16.5869C33.7432 17.0349 33.2042 17.3826 32.5742 17.6299C31.9442 17.8772 31.2442 18.0009 30.4742 18.0009H26.6172V7.87891H30.4742C31.2442 7.87891 31.9442 8.00491 32.5742 8.25691C33.2042 8.50424 33.7432 8.85191 34.1912 9.29991C34.6392 9.74324 34.9869 10.2752 35.2342 10.8959C35.4816 11.5166 35.6052 12.1979 35.6052 12.9399ZM33.6732 12.9399C33.6732 12.3846 33.5986 11.8876 33.4492 11.4489C33.3046 11.0056 33.0922 10.6322 32.8122 10.3289C32.5369 10.0209 32.2009 9.78524 31.8042 9.62191C31.4122 9.45858 30.9689 9.37691 30.4742 9.37691H28.5072V16.5029H30.4742C30.9689 16.5029 31.4122 16.4212 31.8042 16.2579C32.2009 16.0946 32.5369 15.8612 32.8122 15.5579C33.0922 15.2499 33.3046 14.8766 33.4492 14.4379C33.5986 13.9946 33.6732 13.4952 33.6732 12.9399Z" fill="white"/>
                                    <path d="M43.5813 7.87891V9.37691H39.0873V12.3729H42.8813V13.8779H39.0873V18.0009H37.1973V7.87891H43.5813Z" fill="white"/>
                                    </svg>
                                </span>
                                </div>
                                <div className="comments-page__files-text">
                                <p className="comments-page__files-link">Документ №1</p>
                                <time dateTime="2023-02-10 11:30" className="comments-page__files-time">10 фев в 11:30</time>
                                </div>
                                <div className="comments-page__files-action">
                                <span className="cb-icon cb-icon__size-24">
                                    <svg width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
                                    <path fill-rule="evenodd" clip-rule="evenodd" d="M12.7498 7L12.7498 4H11.2498L11.2498 7H12.7498ZM18.4869 8.49525L19.9869 5.99525L18.7007 5.2235L17.2007 7.7235L18.4869 8.49525ZM4.01291 5.99525L5.51291 8.49525L6.79915 7.7235L5.29915 5.2235L4.01291 5.99525ZM4.67903 14.0007C6.33005 16.1178 8.98814 17.5009 11.9988 17.5009C15.0098 17.5009 17.6681 16.1176 19.3191 14.0001C18.2829 12.6715 16.8502 11.632 15.1826 11.042C15.3862 11.4859 15.4998 11.9797 15.4998 12.5C15.4998 14.433 13.9328 16 11.9998 16C10.0668 16 8.49979 14.433 8.49979 12.5C8.49979 11.9795 8.61341 11.4855 8.8172 11.0416C7.14882 11.6316 5.71544 12.6715 4.67903 14.0007ZM20.8665 13.5758C18.9709 10.8131 15.7009 9.00011 11.9996 9H11.9993C8.29751 9 5.02716 10.8133 3.13155 13.5765C2.95614 13.8322 2.95615 14.1694 3.13158 14.4251C5.02727 17.1878 8.29738 19.0009 11.9988 19.0009C15.7006 19.0009 18.9709 17.1875 20.8665 14.4244C21.0419 14.1687 21.0419 13.8314 20.8665 13.5758ZM11.9998 14.5C13.1044 14.5 13.9998 13.6046 13.9998 12.5C13.9998 11.3954 13.1044 10.5 11.9998 10.5C10.8952 10.5 9.99979 11.3954 9.99979 12.5C9.99979 13.6046 10.8952 14.5 11.9998 14.5Z" fill="currentColor"/>
                                    </svg>
                                </span>
                                <span className="cb-icon cb-icon__size-24">
                                    <svg width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
                                    <path fill-rule="evenodd" clip-rule="evenodd" d="M8 4.5H16C16.2761 4.5 16.5 4.72386 16.5 5V7H7.5V5C7.5 4.72386 7.72386 4.5 8 4.5ZM18 5V7H19C20.6569 7 22 8.34315 22 10V16C22 17.6569 20.6569 19 19 19H18C18 20.1046 17.1046 21 16 21H8C6.89543 21 6 20.1046 6 19H5C3.34315 19 2 17.6569 2 16V10C2 8.34315 3.34315 7 5 7H6V5C6 3.89543 6.89543 3 8 3H16C17.1046 3 18 3.89543 18 5ZM6 17.5V13C6 12.4477 6.44771 12 7 12H17C17.5523 12 18 12.4477 18 13V17.5H19C19.8284 17.5 20.5 16.8284 20.5 16V10C20.5 9.17157 19.8284 8.5 19 8.5H5C4.17157 8.5 3.5 9.17157 3.5 10V16C3.5 16.8284 4.17157 17.5 5 17.5H6ZM8 19.5H16C16.2761 19.5 16.5 19.2761 16.5 19V13.5H7.5V19C7.5 19.2761 7.72386 19.5 8 19.5Z" fill="currentColor"/>
                                    </svg>
                                </span>
                                </div>
                            </div>
                            <div className="comments-page__files-item">
                                <div className="comments-page__files-icon">
                                <span className="cb-icon cb-icon__size-48">
                                    <svg width="48" height="24" viewBox="0 0 48 24" fill="none" xmlns="http://www.w3.org/2000/svg">
                                    <path d="M6.98555 24C3.89359 24 1.97073 20.6418 3.53589 17.9752L11.1809 4.9504C12.6173 2.50318 15.2426 1 18.0802 1H43.9996C46.2087 1 47.9996 2.79086 47.9996 5V20C47.9996 22.2091 46.2087 24 43.9996 24H6.98555Z" fill="#FF8A00"/>
                                    <path d="M19.9025 14.4379V18.0009H18.0195V7.87891H21.3095C21.9861 7.87891 22.5718 7.95824 23.0665 8.11691C23.5611 8.27558 23.9695 8.49724 24.2915 8.78191C24.6135 9.06658 24.8515 9.40724 25.0055 9.80391C25.1641 10.2006 25.2435 10.6346 25.2435 11.1059C25.2435 11.5959 25.1618 12.0462 24.9985 12.4569C24.8351 12.8629 24.5901 13.2129 24.2635 13.5069C23.9368 13.8009 23.5261 14.0296 23.0315 14.1929C22.5415 14.3562 21.9675 14.4379 21.3095 14.4379H19.9025ZM19.9025 12.9679H21.3095C21.6548 12.9679 21.9558 12.9259 22.2125 12.8419C22.4691 12.7532 22.6815 12.6296 22.8495 12.4709C23.0221 12.3076 23.1505 12.1116 23.2345 11.8829C23.3185 11.6496 23.3605 11.3906 23.3605 11.1059C23.3605 10.8352 23.3185 10.5902 23.2345 10.3709C23.1505 10.1516 23.0245 9.96491 22.8565 9.81091C22.6885 9.65691 22.4761 9.54024 22.2195 9.46091C21.9628 9.37691 21.6595 9.33491 21.3095 9.33491H19.9025V12.9679Z" fill="white"/>
                                    <path d="M35.6052 12.9399C35.6052 13.6819 35.4816 14.3632 35.2342 14.9839C34.9869 15.6046 34.6392 16.1389 34.1912 16.5869C33.7432 17.0349 33.2042 17.3826 32.5742 17.6299C31.9442 17.8772 31.2442 18.0009 30.4742 18.0009H26.6172V7.87891H30.4742C31.2442 7.87891 31.9442 8.00491 32.5742 8.25691C33.2042 8.50424 33.7432 8.85191 34.1912 9.29991C34.6392 9.74324 34.9869 10.2752 35.2342 10.8959C35.4816 11.5166 35.6052 12.1979 35.6052 12.9399ZM33.6732 12.9399C33.6732 12.3846 33.5986 11.8876 33.4492 11.4489C33.3046 11.0056 33.0922 10.6322 32.8122 10.3289C32.5369 10.0209 32.2009 9.78524 31.8042 9.62191C31.4122 9.45858 30.9689 9.37691 30.4742 9.37691H28.5072V16.5029H30.4742C30.9689 16.5029 31.4122 16.4212 31.8042 16.2579C32.2009 16.0946 32.5369 15.8612 32.8122 15.5579C33.0922 15.2499 33.3046 14.8766 33.4492 14.4379C33.5986 13.9946 33.6732 13.4952 33.6732 12.9399Z" fill="white"/>
                                    <path d="M43.5813 7.87891V9.37691H39.0873V12.3729H42.8813V13.8779H39.0873V18.0009H37.1973V7.87891H43.5813Z" fill="white"/>
                                    </svg>
                                </span>
                                </div>
                                <div className="comments-page__files-text">
                                <p className="comments-page__files-link">Документ №1</p>
                                <time dateTime="2023-02-10 11:30" className="comments-page__files-time">10 фев в 11:30</time>
                                </div>
                                <div className="comments-page__files-action">
                                <span className="cb-icon cb-icon__size-24">
                                    <svg width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
                                    <path fill-rule="evenodd" clip-rule="evenodd" d="M12.7498 7L12.7498 4H11.2498L11.2498 7H12.7498ZM18.4869 8.49525L19.9869 5.99525L18.7007 5.2235L17.2007 7.7235L18.4869 8.49525ZM4.01291 5.99525L5.51291 8.49525L6.79915 7.7235L5.29915 5.2235L4.01291 5.99525ZM4.67903 14.0007C6.33005 16.1178 8.98814 17.5009 11.9988 17.5009C15.0098 17.5009 17.6681 16.1176 19.3191 14.0001C18.2829 12.6715 16.8502 11.632 15.1826 11.042C15.3862 11.4859 15.4998 11.9797 15.4998 12.5C15.4998 14.433 13.9328 16 11.9998 16C10.0668 16 8.49979 14.433 8.49979 12.5C8.49979 11.9795 8.61341 11.4855 8.8172 11.0416C7.14882 11.6316 5.71544 12.6715 4.67903 14.0007ZM20.8665 13.5758C18.9709 10.8131 15.7009 9.00011 11.9996 9H11.9993C8.29751 9 5.02716 10.8133 3.13155 13.5765C2.95614 13.8322 2.95615 14.1694 3.13158 14.4251C5.02727 17.1878 8.29738 19.0009 11.9988 19.0009C15.7006 19.0009 18.9709 17.1875 20.8665 14.4244C21.0419 14.1687 21.0419 13.8314 20.8665 13.5758ZM11.9998 14.5C13.1044 14.5 13.9998 13.6046 13.9998 12.5C13.9998 11.3954 13.1044 10.5 11.9998 10.5C10.8952 10.5 9.99979 11.3954 9.99979 12.5C9.99979 13.6046 10.8952 14.5 11.9998 14.5Z" fill="currentColor"/>
                                    </svg>
                                </span>
                                <span className="cb-icon cb-icon__size-24">
                                    <svg width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
                                    <path fill-rule="evenodd" clip-rule="evenodd" d="M8 4.5H16C16.2761 4.5 16.5 4.72386 16.5 5V7H7.5V5C7.5 4.72386 7.72386 4.5 8 4.5ZM18 5V7H19C20.6569 7 22 8.34315 22 10V16C22 17.6569 20.6569 19 19 19H18C18 20.1046 17.1046 21 16 21H8C6.89543 21 6 20.1046 6 19H5C3.34315 19 2 17.6569 2 16V10C2 8.34315 3.34315 7 5 7H6V5C6 3.89543 6.89543 3 8 3H16C17.1046 3 18 3.89543 18 5ZM6 17.5V13C6 12.4477 6.44771 12 7 12H17C17.5523 12 18 12.4477 18 13V17.5H19C19.8284 17.5 20.5 16.8284 20.5 16V10C20.5 9.17157 19.8284 8.5 19 8.5H5C4.17157 8.5 3.5 9.17157 3.5 10V16C3.5 16.8284 4.17157 17.5 5 17.5H6ZM8 19.5H16C16.2761 19.5 16.5 19.2761 16.5 19V13.5H7.5V19C7.5 19.2761 7.72386 19.5 8 19.5Z" fill="currentColor"/>
                                    </svg>
                                </span>
                                </div>
                            </div>
                            <div className="comments-page__files-item">
                                <div className="comments-page__files-icon">
                                <span className="cb-icon cb-icon__size-48">
                                    <svg width="48" height="24" viewBox="0 0 48 24" fill="none" xmlns="http://www.w3.org/2000/svg">
                                    <path d="M6.98555 24C3.89359 24 1.97073 20.6418 3.53589 17.9752L11.1809 4.9504C12.6173 2.50318 15.2426 1 18.0802 1H43.9996C46.2087 1 47.9996 2.79086 47.9996 5V20C47.9996 22.2091 46.2087 24 43.9996 24H6.98555Z" fill="#9DACCE"/>
                                    <path d="M30.5182 7.87891V8.57191C30.5182 8.78658 30.4576 8.98258 30.3362 9.15991L25.1422 16.4959H30.3992V18.0009H22.6992V17.2589C22.6992 17.1656 22.7156 17.0769 22.7482 16.9929C22.7809 16.9042 22.8229 16.8226 22.8742 16.7479L28.0822 9.37691H23.0282V7.87891H30.5182Z" fill="white"/>
                                    <path d="M34.0521 18.0009H32.1621V7.87891H34.0521V18.0009Z" fill="white"/>
                                    <path d="M38.342 14.4379V18.0009H36.459V7.87891H39.749C40.4257 7.87891 41.0114 7.95824 41.506 8.11691C42.0007 8.27558 42.409 8.49724 42.731 8.78191C43.053 9.06658 43.291 9.40724 43.445 9.80391C43.6037 10.2006 43.683 10.6346 43.683 11.1059C43.683 11.5959 43.6014 12.0462 43.438 12.4569C43.2747 12.8629 43.0297 13.2129 42.703 13.5069C42.3764 13.8009 41.9657 14.0296 41.471 14.1929C40.981 14.3562 40.407 14.4379 39.749 14.4379H38.342ZM38.342 12.9679H39.749C40.0944 12.9679 40.3954 12.9259 40.652 12.8419C40.9087 12.7532 41.121 12.6296 41.289 12.4709C41.4617 12.3076 41.59 12.1116 41.674 11.8829C41.758 11.6496 41.8 11.3906 41.8 11.1059C41.8 10.8352 41.758 10.5902 41.674 10.3709C41.59 10.1516 41.464 9.96491 41.296 9.81091C41.128 9.65691 40.9157 9.54024 40.659 9.46091C40.4024 9.37691 40.099 9.33491 39.749 9.33491H38.342V12.9679Z" fill="white"/>
                                    </svg>
                                </span>
                                </div>
                                <div className="comments-page__files-text">
                                <p className="comments-page__files-link">Документ №1</p>
                                <time dateTime="2023-02-10 11:30" className="comments-page__files-time">10 фев в 11:30</time>
                                </div>
                                <div className="comments-page__files-action">
                                <span className="cb-icon cb-icon__size-24">
                                    <svg width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
                                    <path fill-rule="evenodd" clip-rule="evenodd" d="M12.7498 7L12.7498 4H11.2498L11.2498 7H12.7498ZM18.4869 8.49525L19.9869 5.99525L18.7007 5.2235L17.2007 7.7235L18.4869 8.49525ZM4.01291 5.99525L5.51291 8.49525L6.79915 7.7235L5.29915 5.2235L4.01291 5.99525ZM4.67903 14.0007C6.33005 16.1178 8.98814 17.5009 11.9988 17.5009C15.0098 17.5009 17.6681 16.1176 19.3191 14.0001C18.2829 12.6715 16.8502 11.632 15.1826 11.042C15.3862 11.4859 15.4998 11.9797 15.4998 12.5C15.4998 14.433 13.9328 16 11.9998 16C10.0668 16 8.49979 14.433 8.49979 12.5C8.49979 11.9795 8.61341 11.4855 8.8172 11.0416C7.14882 11.6316 5.71544 12.6715 4.67903 14.0007ZM20.8665 13.5758C18.9709 10.8131 15.7009 9.00011 11.9996 9H11.9993C8.29751 9 5.02716 10.8133 3.13155 13.5765C2.95614 13.8322 2.95615 14.1694 3.13158 14.4251C5.02727 17.1878 8.29738 19.0009 11.9988 19.0009C15.7006 19.0009 18.9709 17.1875 20.8665 14.4244C21.0419 14.1687 21.0419 13.8314 20.8665 13.5758ZM11.9998 14.5C13.1044 14.5 13.9998 13.6046 13.9998 12.5C13.9998 11.3954 13.1044 10.5 11.9998 10.5C10.8952 10.5 9.99979 11.3954 9.99979 12.5C9.99979 13.6046 10.8952 14.5 11.9998 14.5Z" fill="currentColor"/>
                                    </svg>
                                </span>
                                <span className="cb-icon cb-icon__size-24">
                                    <svg width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
                                    <path fill-rule="evenodd" clip-rule="evenodd" d="M8 4.5H16C16.2761 4.5 16.5 4.72386 16.5 5V7H7.5V5C7.5 4.72386 7.72386 4.5 8 4.5ZM18 5V7H19C20.6569 7 22 8.34315 22 10V16C22 17.6569 20.6569 19 19 19H18C18 20.1046 17.1046 21 16 21H8C6.89543 21 6 20.1046 6 19H5C3.34315 19 2 17.6569 2 16V10C2 8.34315 3.34315 7 5 7H6V5C6 3.89543 6.89543 3 8 3H16C17.1046 3 18 3.89543 18 5ZM6 17.5V13C6 12.4477 6.44771 12 7 12H17C17.5523 12 18 12.4477 18 13V17.5H19C19.8284 17.5 20.5 16.8284 20.5 16V10C20.5 9.17157 19.8284 8.5 19 8.5H5C4.17157 8.5 3.5 9.17157 3.5 10V16C3.5 16.8284 4.17157 17.5 5 17.5H6ZM8 19.5H16C16.2761 19.5 16.5 19.2761 16.5 19V13.5H7.5V19C7.5 19.2761 7.72386 19.5 8 19.5Z" fill="currentColor"/>
                                    </svg>
                                </span>
                                </div>
                            </div>
                            <div className="comments-page__files-item">
                                <div className="comments-page__files-icon">
                                <span className="cb-icon cb-icon__size-48">
                                    <svg width="48" height="24" viewBox="0 0 48 24" fill="none" xmlns="http://www.w3.org/2000/svg">
                                    <path d="M6.98555 24C3.89359 24 1.97073 20.6418 3.53589 17.9752L11.1809 4.9504C12.6173 2.50318 15.2426 1 18.0802 1H43.9996C46.2087 1 47.9996 2.79086 47.9996 5V20C47.9996 22.2091 46.2087 24 43.9996 24H6.98555Z" fill="#EE3F58"/>
                                    <path d="M21.3349 12.2974L18.9759 8.81836H20.6419C20.7679 8.81836 20.8613 8.83703 20.9219 8.87436C20.9826 8.90703 21.0363 8.96303 21.0829 9.04236L22.5879 11.4434C22.6113 11.3641 22.6393 11.2847 22.6719 11.2054C22.7093 11.1261 22.7536 11.0467 22.8049 10.9674L24.0159 9.07736C24.1186 8.9047 24.2516 8.81836 24.4149 8.81836H26.0039L23.6379 12.2204L26.1019 16.0004H24.4359C24.3099 16.0004 24.2073 15.9677 24.1279 15.9024C24.0533 15.8371 23.9903 15.7624 23.9389 15.6784L22.4129 13.1794C22.3709 13.3474 22.3126 13.4874 22.2379 13.5994L20.8939 15.6784C20.8426 15.7577 20.7796 15.8324 20.7049 15.9024C20.6303 15.9677 20.5369 16.0004 20.4249 16.0004H18.8779L21.3349 12.2974Z" fill="white"/>
                                    <path d="M32.1703 16.9375V18.0575H26.6543V16.9375H32.1703Z" fill="white"/>
                                    <path d="M35.1845 12.2974L32.8255 8.81836H34.4915C34.6175 8.81836 34.7109 8.83703 34.7715 8.87436C34.8322 8.90703 34.8859 8.96303 34.9325 9.04236L36.4375 11.4434C36.4609 11.3641 36.4889 11.2847 36.5215 11.2054C36.5589 11.1261 36.6032 11.0467 36.6545 10.9674L37.8655 9.07736C37.9682 8.9047 38.1012 8.81836 38.2645 8.81836H39.8535L37.4875 12.2204L39.9515 16.0004H38.2855C38.1595 16.0004 38.0569 15.9677 37.9775 15.9024C37.9029 15.8371 37.8399 15.7624 37.7885 15.6784L36.2625 13.1794C36.2205 13.3474 36.1622 13.4874 36.0875 13.5994L34.7435 15.6784C34.6922 15.7577 34.6292 15.8324 34.5545 15.9024C34.4799 15.9677 34.3865 16.0004 34.2745 16.0004H32.7275L35.1845 12.2974Z" fill="white"/>
                                    </svg>
                                </span>
                                </div>
                                <div className="comments-page__files-text">
                                <p className="comments-page__files-link">Документ №1</p>
                                <time dateTime="2023-02-10 11:30" className="comments-page__files-time">10 фев в 11:30</time>
                                </div>
                                <div className="comments-page__files-action">
                                <span className="cb-icon cb-icon__size-24">
                                    <svg width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
                                    <path fill-rule="evenodd" clip-rule="evenodd" d="M12.7498 7L12.7498 4H11.2498L11.2498 7H12.7498ZM18.4869 8.49525L19.9869 5.99525L18.7007 5.2235L17.2007 7.7235L18.4869 8.49525ZM4.01291 5.99525L5.51291 8.49525L6.79915 7.7235L5.29915 5.2235L4.01291 5.99525ZM4.67903 14.0007C6.33005 16.1178 8.98814 17.5009 11.9988 17.5009C15.0098 17.5009 17.6681 16.1176 19.3191 14.0001C18.2829 12.6715 16.8502 11.632 15.1826 11.042C15.3862 11.4859 15.4998 11.9797 15.4998 12.5C15.4998 14.433 13.9328 16 11.9998 16C10.0668 16 8.49979 14.433 8.49979 12.5C8.49979 11.9795 8.61341 11.4855 8.8172 11.0416C7.14882 11.6316 5.71544 12.6715 4.67903 14.0007ZM20.8665 13.5758C18.9709 10.8131 15.7009 9.00011 11.9996 9H11.9993C8.29751 9 5.02716 10.8133 3.13155 13.5765C2.95614 13.8322 2.95615 14.1694 3.13158 14.4251C5.02727 17.1878 8.29738 19.0009 11.9988 19.0009C15.7006 19.0009 18.9709 17.1875 20.8665 14.4244C21.0419 14.1687 21.0419 13.8314 20.8665 13.5758ZM11.9998 14.5C13.1044 14.5 13.9998 13.6046 13.9998 12.5C13.9998 11.3954 13.1044 10.5 11.9998 10.5C10.8952 10.5 9.99979 11.3954 9.99979 12.5C9.99979 13.6046 10.8952 14.5 11.9998 14.5Z" fill="currentColor"/>
                                    </svg>
                                </span>
                                <span className="cb-icon cb-icon__size-24">
                                    <svg width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
                                    <path fill-rule="evenodd" clip-rule="evenodd" d="M8 4.5H16C16.2761 4.5 16.5 4.72386 16.5 5V7H7.5V5C7.5 4.72386 7.72386 4.5 8 4.5ZM18 5V7H19C20.6569 7 22 8.34315 22 10V16C22 17.6569 20.6569 19 19 19H18C18 20.1046 17.1046 21 16 21H8C6.89543 21 6 20.1046 6 19H5C3.34315 19 2 17.6569 2 16V10C2 8.34315 3.34315 7 5 7H6V5C6 3.89543 6.89543 3 8 3H16C17.1046 3 18 3.89543 18 5ZM6 17.5V13C6 12.4477 6.44771 12 7 12H17C17.5523 12 18 12.4477 18 13V17.5H19C19.8284 17.5 20.5 16.8284 20.5 16V10C20.5 9.17157 19.8284 8.5 19 8.5H5C4.17157 8.5 3.5 9.17157 3.5 10V16C3.5 16.8284 4.17157 17.5 5 17.5H6ZM8 19.5H16C16.2761 19.5 16.5 19.2761 16.5 19V13.5H7.5V19C7.5 19.2761 7.72386 19.5 8 19.5Z" fill="currentColor"/>
                                    </svg>
                                </span>
                                </div>
                            </div>
                            </div>
                        </div>
                        </div>
                        <div className="comments-page__card is-inner">
                        <div className="comments-page__card-header">
                            <a href="" className="comments-page__card-link-back">Назад</a>
                            <p className="comments-page__card-title">Эксперты</p>
                        </div>
                        <div className="comments-page__experts">
                            <div className="comments-page__experts-list">
                            <div className="comments-page__experts-item">
                                <div className="comments-page__experts-icon">ТЖ</div>
                                <div className="comments-page__experts-text">
                                <p className="comments-page__experts-title">Татьяна Жилина</p>
                                <p className="comments-page__experts-subtitle">ДПР | Старший юрист</p>
                                </div>
                                <div className="comments-page__experts-action">
                                <p className="comments-page__experts-link is-point">Новый комментарий</p>
                                </div>
                            </div>
                            <div className="comments-page__experts-item">
                                <div className="comments-page__experts-icon">АЗ</div>
                                <div className="comments-page__experts-text">
                                <p className="comments-page__experts-title">Андрей Золотых</p>
                                <p className="comments-page__experts-subtitle">ЦУМ | Начальник управления</p>
                                </div>
                                <div className="comments-page__experts-action">
                                </div>
                            </div>
                            <div className="comments-page__experts-item">
                                <div className="comments-page__experts-icon">АС</div>
                                <div className="comments-page__experts-text">
                                <p className="comments-page__experts-title">Александр Суворов</p>
                                <p className="comments-page__experts-subtitle">ДПР | Младший юрист</p>
                                </div>
                                <div className="comments-page__experts-action">
                                </div>
                            </div>
                            </div>
                        </div>
                        </div>
                    </div>
                    </div>
                </div>
                </div>
                </main>
            </body>
</div>

    )

}

export default EntityCheks;